{
  "s": 1,
  "d": [
    {
      "id": "560",
      "Title": "Beef and Ginger Stir-Fry",
      "Ingredients": {
        "1": "1 lb. skirt steak, trimmed, sliced against the grain into 1/4\"-thick strips, patted dry",
        "2": "1 tsp. sugar",
        "3": "1 tsp. toasted sesame oil",
        "4": "1 tsp. plus 1 Tbsp. soy sauce",
        "5": "1 tsp. kosher salt, plus more",
        "6": "1 Tbsp. vegetable oil",
        "7": "1 medium sweet onion, sliced into 1/2\"-thick rounds",
        "8": "1 (3\") piece ginger, peeled, very thinly sliced",
        "9": "Freshly ground black pepper",
        "10": "3 Tbsp. unsalted butter, cut into pieces",
        "11": "1 Tbsp. fresh lemon juice",
        "12": "Cooked rice (for serving)"
      },
      "Instructions": "Toss steak in a medium bowl with sugar, sesame oil, 1 tsp. soy sauce, and 1 tsp. salt to coat and let sit 20 minutes.\nPlace a large skillet over high heat. Pour in vegetable oil and swirl to coat bottom of pan. The oil should be shimmering and you should see some wisps of smoke—if it’s not hot enough, the meat will steam instead of getting deeply browned.\nAdd steak to skillet in an even layer (it’s okay to crowd it a bit) and cook, undisturbed, until brown around the edges, about 2 minutes. Turn steak over and add onion, ginger, lots of pepper, and 1/3 cup water. Cook, tossing often, until onion is just tender and ginger is softened, about 2 minutes.\nRemove skillet from heat and add butter, lemon juice, and remaining 1 Tbsp. soy sauce. Toss until butter is melted and coats steak. Taste and season with more salt if needed.\nDivide rice among bowls and top with beef stir-fry.",
      "Image": "//20fix.com/xfood/img/beef-and-ginger-stir-fry.jpg"
    },
    {
      "id": "780",
      "Title": "Corned Beef with Crispy Roasted Potatoes and Cabbage",
      "Ingredients": {
        "1": "1 (3–4-lb.) corned beef brisket",
        "2": "2 lb. russet potatoes, scrubbed, quartered",
        "3": "1 1/4 cups extra-virgin olive oil, divided",
        "4": "Kosher salt, freshly ground pepper",
        "5": "1 large green cabbage, cut through the core into 8 wedges",
        "6": "4 whole cloves",
        "7": "1 tsp. coriander seeds",
        "8": "1 tsp. mustard seeds",
        "9": "1 tsp. peppercorns",
        "10": "1/2 tsp. crushed red pepper flakes",
        "11": "2 garlic cloves, finely grated",
        "12": "6 Tbsp. white wine vinegar",
        "13": "1 Tbsp. honey",
        "14": "1 cup finely chopped dill",
        "15": "A mortar and pestle"
      },
      "Instructions": "Place corned beef in a large pot. Add enough water to cover by 2\" and bring to a boil. Reduce heat to low, cover, and simmer until very tender, 3–3 1/2 hours.\nOnce beef has been simmering for 2 1/2 hours, arrange racks in top and bottom thirds of oven; preheat to 375°F. Toss potatoes, 1/4 cup oil, 1 tsp. salt, and 1 tsp. pepper on a rimmed baking sheet. Rub cabbage wedges with 1/4 cup oil; season on all sides with 1 tsp. salt and 1 tsp. pepper. Arrange on another rimmed baking sheet. Roast, turning cabbage, tossing potatoes, and rotating sheets top to bottom halfway through, until golden brown and tender, 45–40 minutes. (The cabbage might be done before the potatoes.)\nMeanwhile, coarsely crush cloves, coriander seeds, mustard seeds, peppercorns, and red pepper flakes with mortar and pestle. Transfer to a small saucepan and cook over medium heat, swirling often, until fragrant, about 2 minutes. Add garlic and remaining 3/4 cup oil and cook, stirring, until garlic sizzles, about 1 minute. Transfer to a medium heatproof bowl. Stir in vinegar, honey, and 2 tsp. salt. Let cool, then stir in dill.\nTransfer beef to a cutting board and let sit 10 minutes. Trim off excess fat, then thinly slice against the grain. Serve alongside roasted cabbage and potatoes with dill sauce drizzled over.",
      "Image": "//20fix.com/xfood/img/corned-beef-with-crispy-roasted-potatoes-and-cabbage.jpg"
    },
    {
      "id": "896",
      "Title": "Beef Rib Roast with Garlic and Rosemary",
      "Ingredients": {
        "1": "12 garlic cloves",
        "2": "1/4 cup chopped rosemary",
        "3": "2 Tbsp kosher salt",
        "4": "1 (4-rib) standing beef rib roast (bone-in prime rib; 9 to 10 lb)"
      },
      "Instructions": "Pulse garlic, rosemary, salt, and 1 tsp pepper in a food processor until smooth, then rub all over roast. Transfer to a rack set in a 13- by 9-inch roasting pan and marinate, chilled, at least 8 hours.\nLet roast stand at room temperature 1 hour.\nPreheat oven to 450°F with rack in middle. Roast meat, fat side up, 20 minutes. Reduce oven temperature to 350°F and roast until an instant-read thermometer inserted into center of meat (do not touch bone) registers 110°F, 1 1/2 to 2 hours more. Transfer to a platter and let rest, uncovered, 30 minutes (temperature of meat will rise to about 130°F for medium-rare).\nBeef can be marinated 1 day ahead.",
      "Image": "//20fix.com/xfood/img/beef-rib-roast-with-garlic-and-rosemary.jpg"
    },
    {
      "id": "960",
      "Title": "Instant Pot Beef and Sweet Potato Chili",
      "Ingredients": {
        "1": "2 medium red onions",
        "2": "4 oz. bacon, finely chopped",
        "3": "1 lb. ground beef (20% fat)",
        "4": "3 1/2 tsp. kosher salt, divided",
        "5": "6 garlic cloves, peeled, smashed",
        "6": "2 tsp. ground cumin",
        "7": "1 tsp. smoked paprika",
        "8": "3 Tbsp. harissa paste",
        "9": "4 cups homemade beef stock or low-sodium beef broth",
        "10": "1 1/2 lb. sweet potatoes, peeled, finely chopped",
        "11": "1/2 lb. dried kidney beans",
        "12": "Sour cream, cilantro, and finely grated cheddar cheese (for serving)",
        "13": "An Instant Pot or pressure cooker"
      },
      "Instructions": "Finely chop onions. Set aside 1/2 cup for serving.\nPlace bacon in Instant Pot and cook on Sauté setting (or cook over medium-high heat in pressure cooker), stirring occasionally, until dark golden brown and most of the fat is rendered, 6–8 minutes. Using a slotted spoon, transfer bacon to a medium bowl.\nLet pot heat up again for at least 2 minutes before adding beef; season with 2 tsp. salt. Cook, undisturbed, until browned underneath, 8–10 minutes. Break into bite-size pieces, then transfer to bowl with bacon. Add remaining chopped onion, garlic, cumin, and paprika to pot and cook, stirring occasionally, until softened, about 5 minutes. Add harissa and cook, stirring constantly, until it starts to stick to bottom of pot, about 2 minutes. Add stock, potatoes, beans, and remaining 1/2 tsp. salt, stirring to combine. Return reserved bacon and beef to pot and stir again to combine.\nLock lid and cook chili at high pressure 40 minutes. Let steam release naturally. Stir chili until most of the potatoes have broken down (they will thicken the chili in the process and become part of the liquid). If chili seems too thick, stir in a little bit of water or more stock to loosen. Taste and season with salt if needed.\nDivide chili among bowls. Top with sour cream, cilantro, cheese, and reserved onion.",
      "Image": "//20fix.com/xfood/img/instant-pot-beef-and-sweet-potato-chili.jpg"
    },
    {
      "id": "1072",
      "Title": "Cold Beef Tenderloin with Tomatoes and Cucumbers",
      "Ingredients": {
        "1": "1/4 cup extra-virgin olive oil, plus more",
        "2": "1 (3 1/2–4-lb.) beef tenderloin",
        "3": "3 Tbsp. whole black peppercorns, coarsely crushed",
        "4": "2 Tbsp. kosher salt",
        "5": "3 lb. heirloom tomatoes (6–8), sliced into 1/4\"-thick rounds",
        "6": "6 mini seedless or Persian cucumbers, sliced into 1/4\"-thick rounds",
        "7": "1 cup basil leaves",
        "8": "Sherry vinegar or red wine vinegar (for serving)",
        "9": "Flaky sea salt",
        "10": "Freshly ground black pepper",
        "11": "Lemony Yogurt Sauce and/or Grilled Serrano Salsa Verde (for serving)"
      },
      "Instructions": "Prepare a grill for 2-zone heat (for a charcoal grill, bank two-thirds of coals over one side of grill and scatter remaining coals over the other side; for a gas grill, set one burner to high heat and the remaining burners to medium-low heat). Clean and lightly oil grate. Rub tenderloin with 1/4 cup oil and sprinkle with peppercorns and kosher salt. Grill over hottest part of grill, turning often, until lightly charred on all sides, about 5 minutes. Move to cooler part and continue to grill, turning often, until an instant-read thermometer inserted into the thickest part registers 120°F for medium-rare, 25–30 minutes longer. Transfer to a platter and let cool.\nJust before serving, thinly slice tenderloin on a large cutting board you can also serve from (or transfer back to platter). Arrange tomato slices, cucumber slices, and basil alongside. Drizzle tomatoes and cucumbers very lightly with vinegar. Drizzle oil over everything and season liberally with sea salt and ground pepper. Serve with Lemony Yogurt Sauce and/or Grilled Serrano Salsa Verde alongside.\nBeef tenderloin can be grilled 1 day ahead. As soon as it is cool, wrap tightly in plastic (do not slice) and chill until ready to serve.",
      "Image": "//20fix.com/xfood/img/cold-beef-tenderloin-with-tomatoes-and-cucumbers.jpg"
    },
    {
      "id": "1122",
      "Title": "Hummus Dinner Bowls with Spiced Ground Beef and Tomatoes",
      "Ingredients": {
        "1": "1 Tbsp. vegetable oil",
        "2": "1 lb. ground beef",
        "3": "1 tsp. ground coriander",
        "4": "1/2 tsp. freshly ground black pepper",
        "5": "1/2 tsp. ground cinnamon",
        "6": "2 tsp. kosher salt, divided",
        "7": "1 pint cherry tomatoes or 2 medium heirloom or beefsteak tomatoes, cut into 1\" pieces",
        "8": "1 cup parsley leaves with tender stems, coarsely chopped",
        "9": "1 Tbsp. fresh lemon juice",
        "10": "1 batch Easy Canned Chickpea Hummus",
        "11": "Extra-virgin olive oil, lemon wedges, Aleppo-style pepper, hot sauce, pickles, and pita (for serving; optional)"
      },
      "Instructions": "Heat oil in a large heavy, preferably cast-iron, skillet over high. Pat beef dry with paper towels, then press into an even layer in skillet with a spatula. Season with coriander, pepper, cinnamon, and 1 tsp. salt and cook, undisturbed, until a brown crust begins to form underneath, about 6 minutes. Turn, break beef into pieces, and continue to cook, stirring, until just cooked through, about 1 minute.\nMeanwhile, toss tomatoes, parsley, lemon juice, and remaining 1 tsp. salt in a medium bowl.\nDivide hummus among shallow bowls. Using the back of a spoon, smooth into an even layer, then create a wide divot in the center. Spoon spiced beef and tomato mixture over, then drizzle with oil and sprinkle with Aleppo-style pepper, if using. Serve with lemon wedges, hot sauce, pickles, and pita alongside, if using.",
      "Image": "//20fix.com/xfood/img/hummus-dinner-bowls-with-spiced-ground-beef-and-tomatoes.jpg"
    },
    {
      "id": "1226",
      "Title": "Beef Sliders with Provolone and Balsamic Onions",
      "Ingredients": {
        "1": "2 lb. ground beef (20% fat)",
        "2": "Kosher salt, freshly ground pepper",
        "3": "4 slices provolone piccante cheese, torn in half",
        "4": "8 potato slider buns",
        "5": "1 large red onion, very thinly sliced into rounds",
        "6": "3 Tbsp. balsamic vinegar",
        "7": "1 tsp. sugar",
        "8": "Aioli or store-bought mayonnaise (for serving)"
      },
      "Instructions": "Divide meat into 8 portions (about 4 oz. each). Place 1 portion on a work surface. Cup your hands around the meat and shape it into a rounded mound. Gently flatten patty to about 3/4\" thick. Season both sides with salt and pepper. Repeat with remaining portions of meat.\nPrepare a grill for medium-high heat. Grill patties until lightly charred on bottom, about 3 minutes. Flip and top with a piece of cheese. Grill to desired doneness (cheese should be melted), about 3 minutes for medium-rare. Transfer patties to a cutting board and let rest 5 minutes.\nWhile patties are resting, grill the buns, cut side down, until lightly charred around the edges, about 30 seconds.\nToss onion with vinegar, sugar, and a pinch of salt in a medium bowl and let sit, squeezing onions occasionally to soften slightly, 5 minutes.\nBuild sliders with patties, buns, onions, and aioli.\nPatties can be formed 6 hours ahead. Cover and chill.",
      "Image": "//20fix.com/xfood/img/beef-sliders-with-provolone-and-balsamic-onions.jpg"
    },
    {
      "id": "1386",
      "Title": "Slow Cooker Corned Beef Brisket with Cabbage, Potatoes & Dill",
      "Ingredients": {
        "1": "2 cups apple juice",
        "2": "2 tablespoons real maple syrup",
        "3": "1 teaspoon Instacure #1 (optional)",
        "4": "1 teaspoon yellow mustard seeds",
        "5": "1/2 teaspoon Tellicherry black peppercorns",
        "6": "1 teaspoon caraway seeds",
        "7": "1/2 teaspoon allspice berries",
        "8": "4 bay leaves",
        "9": "Kosher salt",
        "10": "1 quart ice cubes",
        "11": "4 pounds beef brisket (fatty or lean, up to you)",
        "12": "1 tablespoon olive oil",
        "13": "2 medium yellow onions, halved",
        "14": "2 tablespoons brown miso paste",
        "15": "4 garlic cloves",
        "16": "2 tablespoons unsalted butter",
        "17": "1 head Savoy cabbage, sliced into thin ribbons (about 3 cups)",
        "18": "Dill Potatoes, to serve",
        "19": "2 tablespoons chopped fresh dill",
        "20": "1/4 cup Pickled Mustard Seeds, for garnish",
        "21": "6-quart (or larger) slow cooker"
      },
      "Instructions": "Pour 1 1/2 quarts of cold water and the apple juice into a large pot and bring to a boil. Add the maple syrup, Instacure, mustard seeds, peppercorns, 1/2 teaspoon of the caraway seeds, the allspice berries, bay leaves, and 1/2 cup salt. Cook for 3 minutes at a rapid boil; then remove from the heat. Add the ice and wait for the brine to cool to room temperature.\nPlace the brisket in a large container and cover it fully with the brine. (If you have an extra-large sealable plastic bag, those work really well, keeping the meat fully immersed in the brine.) Cover with a lid or plastic wrap and store in the refrigerator for 1 week.\nAfter that week, remove the brisket from the brine and strain the brine, saving the spices and bay leaves and discarding the liquid. Set the brisket aside on a plate.\nPreheat a large slow cooker on the low setting for at least 20 minutes.\nIn large skillet, warm the olive oil over medium-high heat. When the oil begins to shimmer, add the onions and cook for 15 minutes, turning them once in a while, until they are well browned and a touch charred.\nPlace the brisket in the slow cooker and add the charred onions, miso, garlic, 1 tablespoon of the butter, and the strained spices and bay leaves. Add enough room-temperature water to cover the brisket by 2 inches. Cover with the lid and cook on the low setting for 8 to 10 hours, until the brisket is really tender—a paring knife should plunge into the meat with little resistance. Skim off any fat that has risen to the surface.\nPlace a large skillet over medium-high heat and add the remaining 1 tablespoon butter. When it begins to bubble and froth, add the cabbage, remaining 1/2 teaspoon caraway seeds, and 1/2 teaspoon salt. Stir to combine; then let the cabbage char for 2 minutes to develop some color. Toss the cabbage and cook for another 2 minutes. Then transfer it to a large platter.\nRemove the brisket from the slow cooker, taking care to keep it in one piece. Place it on top of the cabbage on the platter, let it rest for 5 minutes, and then slice it into 1/2-inch-thick slabs, against the grain. It will be very tender, and it may fall apart. That’s okay. We want that. Add the potatoes to the platter. Garnish with the fresh dill and the Pickled Mustard Seeds.",
      "Image": "//20fix.com/xfood/img/slow-cooker-corned-beef-brisket-with-cabbage-potatoes-and-dill-hugh-acheson.jpg"
    },
    {
      "id": "1428",
      "Title": "Beef Chili",
      "Ingredients": {
        "1": "4 large or 6 medium ancho chiles",
        "2": "2 dried guajillo chiles",
        "3": "2 dried pasilla chiles",
        "4": "3 tablespoons extra-virgin olive oil",
        "5": "5 pounds boneless beef chuck, cut into 1/2-inch slices",
        "6": "2 large yellow onions, chopped",
        "7": "6 garlic cloves, finely chopped",
        "8": "1 tablespoon ground cumin",
        "9": "2 teaspoons dried oregano",
        "10": "1 (14.5-ounce) can fire-roasted crushed tomatoes",
        "11": "3 tablespoons dark brown sugar",
        "12": "1 (12-ounce) bottle lager",
        "13": "2 teaspoons apple cider vinegar",
        "14": "Kosher salt, freshly ground pepper', \"Toppings as desired (sour cream, grated cheddar, chopped red onion, lime wedges, cilantro, sliced avocado, pickled jalapeños, corn nuts, and don't forget Fritos)\"]"
      },
      "Instructions": "Remove seeds from ancho, guajillo, and pasilla chiles and place in a medium bowl. Pour in 3 cups boiling water and cover bowl tightly with plastic wrap; let sit until chiles are softened, 20–25 minutes. Transfer chiles and soaking liquid to a blender and blend on high until smooth, about 1 minute; set aside.\nHeat oil in a large Dutch oven or other heavy pot over medium-high. Season beef all over with salt and pepper. Working in 2–3 batches, cook, turning pieces once, until browned, about 5 minutes per side. Transfer to a plate.\nReduce heat to medium; add onions and garlic to pot. Cook, stirring often to loosen browned bits from bottom of pot, until onions are translucent and very soft, 6–8 minutes. Add cumin and oregano and cook, stirring, until spices start to stick to pot, about 1 minute. Add tomatoes and brown sugar and scrape bottom of pot to loosen spices, then add lager. Bring to a lively simmer and cook, stirring occasionally, until beer is almost completely evaporated, 10–15 minutes.\nMeanwhile, cut beef into 1/2\" pieces, discarding any large bits of fat or gristle.\nAdd beef, reserved chile purée, and 2 cups water to pot; season with salt and pepper. Bring to a boil, reduce heat, and simmer gently, uncovered, until liquid is thickened and meat is very tender, 1 1/2–2 hours. Taste chili and season with more salt and pepper if needed. Remove from heat and stir in vinegar. Divide chili among bowls and top as desired.\nChili can be made 4 days ahead. Let cool; cover and chill. Reheat gently over low, stirring occasionally, and adding a splash of water to loosen if needed.",
      "Image": "//20fix.com/xfood/img/beef-chili.jpg"
    },
    {
      "id": "1460",
      "Title": "Instant Pot Beef Barbacoa Tacos",
      "Ingredients": {
        "1": "1/4 cup apple cider vinegar",
        "2": "2 tablespoons freshly squeezed lime juice",
        "3": "3 cloves garlic, minced",
        "4": "1 chipotle chile in adobo, minced",
        "5": "2 teaspoons ground cumin",
        "6": "2 teaspoons dried oregano",
        "7": "1 teaspoon salt",
        "8": "1/2 teaspoon freshly ground black pepper",
        "9": "1/4 teaspoon ground cloves",
        "10": "2 tablespoons vegetable oil",
        "11": "2 1/2 pounds boneless beef chuck roast, trimmed of most fat and cut into large chunks",
        "12": "1/2 cup reduced-salt chicken broth or All-Purpose Chicken Stock",
        "13": "2 bay leaves",
        "14": "Small (6-inch) corn tortillas, for serving",
        "15": "Salsa or pico de gallo, for serving",
        "16": "Cotija cheese, for serving"
      },
      "Instructions": "Whisk together the vinegar, lime juice, garlic, chipotle, cumin, oregano, salt, pepper, and cloves in a medium bowl. Set aside.\nPress Sauté and use the Sauté or Adjust button to select the highest temperature (“More”). Place the vegetable oil in the inner pot. Wait until the display reads “Hot,” about 5 minutes, then add the beef. Cook with the lid off, turning the beef every 2 minutes, until the beef is browned on most sides, about 8 minutes.\nAdd the vinegar sauce and the chicken broth (be careful—steam may whoosh up!), and then the bay leaves. Stir to combine.\nClose and lock the lid. Set the valve to Sealing. Press Cancel, then press Manual or Pressure Cook and use the Pressure or Pressure Level button to select High Pressure. Use the – or + button to set the time to 30 minutes.\nWhen the cooking cycle ends, press Cancel. Allow the appliance to cool and release pressure naturally, about 20 minutes. (The pressure is released when the small metal float valve next to the pressure-release valve sinks back into the lid and the lid is no longer locked.)\nRemove the lid. Discard the bay leaves. Use tongs or a large spoon to remove the beef from the inner pot and place it on a cutting board. Shred the beef using two forks: Use one fork to pull off a chunk and then use two forks to shred that piece, holding down the meat with one fork and pulling at it with the other. Repeat with the remaining beef.\nServe the beef hot, piled into corn tortillas and topped with salsa and a sprinkling of Cotija cheese, if desired.",
      "Image": "//20fix.com/xfood/img/instant-pot-shredded-beef-barbacoa-tacos.jpg"
    },
    {
      "id": "1470",
      "Title": "Beef Short Ribs Satay (Satay Kra-Toog Ngua)",
      "Ingredients": {
        "1": "1/4 cup (40 grams) thinly sliced lemongrass",
        "2": "1/8 cup (25 grams) peeled and sliced fresh ginger",
        "3": "1/4 cup (40 grams) sliced shallots",
        "4": "5 peeled medium garlic cloves (15 grams)",
        "5": "2 tablespoons (18 grams) canola oil",
        "6": "2 tablespoons (30 grams) oyster sauce",
        "7": "1 tablespoon (12 grams) fish sauce",
        "8": "1/4 teaspoon (1 gram) turmeric power",
        "9": "1/3 cup (87 grams) unsweetened coconut milk",
        "10": "1 pound (454 grams) beef short ribs, cut Korean kalbi style, 1/4-inch thick",
        "11": "1/3 cup (87 grams) unsweetened coconut milk",
        "12": "Kosher salt, to taste",
        "13": "1 cup Satay Peanut Sauce",
        "14": "1 cup Cucumber Ajat"
      },
      "Instructions": "In a mortar, combine the lemongrass, ginger, shallots, and garlic; pound to a semismooth paste. Stir in the oil, oyster sauce, fish sauce, turmeric, and the 1/3 cup coconut milk and mix well. Reserve 1/4 cup of this mixture and set aside. Transfer the rest to a large mixing bowl and add the short ribs. Toss the ribs to coat, cover the bowl, and let them marinate in the refrigerator for 24 hours (you can get away with marinating for 6 hours at a minimum, though the satay will have less depth of flavor).\nWhen it is time to cook the ribs, preheat your grill until very hot. I highly recommend cooking satay on an outdoor grill over charcoal briquettes, but gas will suffice (cook them indoors in a grill pan only if you have a very good exhaust system, since they generate a lot of smoke). Make the baste by mixing the reserved 1/4 cup marinade with the 1/3 cup coconut milk. Grill the ribs for about 2 minutes on each side (a little more or less, depending on how you like your meat). As they cook, brush the ribs with the basting liquid and a sprinkling of salt. Let the cooked ribs rest for 2 minutes before serving with the satay peanut sauce and cucumber ajat. Accompany with jasmine or sticky rice or slices of toasted white bread.",
      "Image": "//20fix.com/xfood/img/beef-short-ribs-satay-satay-kra-toog-ngua.jpg"
    },
    {
      "id": "1522",
      "Title": "Filipino-Style Beef Steak with Onion and Bay Leaves (Bistek)",
      "Ingredients": {
        "1": "2 (1-inch-thick) boneless rib-eye steaks, excess fat trimmed",
        "2": "2 tablespoons vegetable oil, divided",
        "3": "8 fresh bay leaves",
        "4": "1 large white onion, sliced into 1/2\" thick rounds",
        "5": "1/4 cup fresh lemon juice",
        "6": "1/4 cup soy sauce",
        "7": "Kosher salt"
      },
      "Instructions": "Slice steaks in half lengthwise. Following natural seams in meat, cut each half into 2–3 pieces and set aside.\nHeat 1 Tbsp. oil in a large skillet over medium. Add bay leaves; cook until beginning to brown around the edges, about 1 minute. Add onion and 1/2 cup water. Cover skillet (use a baking sheet if you don’t have a lid) and cook until onion is partly tender; it should have lost its raw bite but still have some crunch, about 5 minutes. Transfer onion and bay leaves to a plate with a slotted spatula or tongs.\nIncrease heat to medium-high and bring remaining liquid in skillet to a boil. Cook until only 2 Tbsp. remains. Scrape into a small bowl and stir in lemon juice and soy sauce. Set sauce aside.\nWipe out skillet and heat remaining 1 Tbsp. oil in skillet over medium-high. Season reserved meat with salt. Working in batches, cook meat undisturbed until dark brown, about 2 minutes. Turn and cook until second side is lightly browned, about 45 seconds. Transfer to a platter.\nReduce heat to medium (let skillet cool a little if it is very hot) and cook reserved sauce in skillet just to let flavors meld, about 1 minute. Add 1–2 Tbsp. water if sauce is too concentrated. Pour over meat and top with onion and bay leaves.",
      "Image": "//20fix.com/xfood/img/filipino-style-beef-steak-with-onion-and-bay-leaves-bistek.jpg"
    },
    {
      "id": "1531",
      "Title": "Good Luck Beef and Korean Rice Cake Soup (Tteokguk)",
      "Ingredients": {
        "1": "1 1/2-pound piece point- or flat-cut beef brisket or stew meat, fat trimmed",
        "2": "1 teaspoon toasted sesame oil",
        "3": "1 tablespoon plus 2 teaspoons vegetable oil",
        "4": "Kosher salt",
        "5": "4 scallions",
        "6": "1 (3-inch) piece ginger, peeled",
        "7": "4 garlic cloves, finely grated",
        "8": "1/3 Korean radish, peeled, quartered lengthwise, sliced crosswise 1/2\" thick, or 1/2 medium daikon, halved lengthwise, sliced crosswise 1/2\" thick",
        "9": "4 large eggs",
        "10": "8–10 ounces Korean rice cakes (tteok), sliced",
        "11": "2 teaspoons fish sauce",
        "12": "Freshly ground black pepper",
        "13": "Korean red chile threads (optional; for serving)"
      },
      "Instructions": "Cut meat into 1 1/2\" pieces. Heat sesame oil and 1 Tbsp. vegetable oil in a large pot over medium-high. Add meat and season with salt. Cook, turning occasionally, until browned on all sides, 8–12 minutes.\nMeanwhile, separate scallion whites from greens and coarsely chop; set aside. Thinly slice scallion greens and set aside separately for serving.\nUsing a flat-bottomed mug or the side of a chef’s knife, lightly smash ginger. Add to pot along with garlic, reserved scallion whites, and 16 cups cold water and bring to a boil. Reduce heat and simmer, skimming any foam from surface, until meat is tender, 60–75 minutes, if using stew meat, or up to 2 hours , if using brisket. Transfer meat to a plate with a slotted spoon, then scoop out ginger and scallion whites and discard.\nAdd Korean radish to pot and simmer until tender but not mushy (it should still hold its shape), 12–15 minutes.\nMeanwhile, heat 1 tsp. vegetable oil in a medium nonstick skillet over medium. Whisk eggs in a medium bowl and season with a large pinch of salt. Pour half of eggs into the center of skillet and quickly swirl pan to distribute evenly. Cook eggs undisturbed until they are just set, about 2 minutes. Carefully loosen with a heatproof rubber spatula, flip, and cook until other side is just set, about 1 minute. Slide egg crepe onto a cutting board and fold in half; let cool. Slice into 1/4\"-thick ribbons. Repeat with remaining eggs and 1 tsp. vegetable oil.\nSlice beef as thin as you can and return to pot; add rice cakes. Cook until rice cakes are soft, about 5 minutes. Stir in fish sauce; taste and season soup with more salt and a few grinds of pepper.\nLadle soup into bowls and top with sliced egg, reserved scallion greens, and chile threads (if using).\nSoup (without garnishes) can be made 2 days ahead. Let cool; cover and chill. Reheat over medium before serving.",
      "Image": "//20fix.com/xfood/img/good-luck-beef-and-korean-rice-cake-soup-tteokguk.jpg"
    },
    {
      "id": "1558",
      "Title": "Instant Pot Slow-Cooked Ground Beef and Cocoa Chili",
      "Ingredients": {
        "1": "1 tablespoon extra-virgin olive oil",
        "2": "2 medium white or yellow onions, finely chopped",
        "3": "1 medium green or red bell pepper, stemmed, seeded, and chopped",
        "4": "2 cloves garlic, finely chopped",
        "5": "1 small jalapeño, stemmed, seeded, and finely chopped",
        "6": "1 pound ground beef",
        "7": "3 tablespoons chili powder",
        "8": "2 tablespoons unsweetened cocoa powder",
        "9": "1/4 teaspoon salt, plus extra as needed",
        "10": "1/4 teaspoon freshly ground black pepper, plus extra as needed",
        "11": "1 (14 1/2-ounce) can diced tomatoes, drained",
        "12": "1 cup store-bought reduced-salt beef broth, or homemade beef broth",
        "13": "Finely grated zest and freshly squeezed juice of 2 medium limes",
        "14": "1 (15 ounce) can black beans, drained and rinsed",
        "15": "Crushed roasted peanuts, for garnish"
      },
      "Instructions": "Press Sauté and select the lowest temperature. Place the olive oil in the inner pot, wait about 1 minute for it to warm, then add the onions, bell pepper, garlic, and jalapeño. Cook with the lid off, stirring occasionally, until the onions soften slightly, about 5 minutes. Add the beef and sauté until no longer pink, about 5 minutes.\nAdd the chili powder, cocoa powder, salt, pepper, tomatoes, broth, and lime zest and juices and stir to combine, scraping up any brown bits off the bottom.\nClose and lock the lid. Set the valve to Venting. Attach the condensation collector. Press Cancel, then press Slow Cook and select the lowest temperature. Set the time to 5 hours.\nWhen the cooking time is finished, press Cancel and remove the lid. Add the beans, stir to distribute evenly, and then close and lock the lid to allow the residual heat to warm the beans, about 5 minutes.\nTaste and adjust the seasoning, adding more salt and pepper as needed. Serve hot, garnished with crushed peanuts.\nChili will keep, in an airtight container in the refrigerator, for up to 4 days.",
      "Image": "//20fix.com/xfood/img/instant-pot-slow-cooked-ground-beef-and-cocoa-chili.jpg"
    },
    {
      "id": "1706",
      "Title": "Oven-Baked Beef Meatballs",
      "Ingredients": {
        "1": "1 large egg",
        "2": "4 garlic cloves, 2 finely grated, 2 thinly sliced",
        "3": "3 tablespoons white miso",
        "4": "3 tablespoons whole milk",
        "5": "1 1/2 teaspoons berbere or garam masala",
        "6": "1 teaspoon kosher salt, plus more",
        "7": "3/4 ounces Pecorino, finely grated (about 3/4 cup)",
        "8": "3 tablespoons panko (Japanese breadcrumbs)",
        "9": "1 pound ground beef",
        "10": "2 tablespoons dried currants",
        "11": "2 bunches Tuscan kale, ribs and stems removed, leaves torn",
        "12": "3 tablespoons olive oil, divided",
        "13": "8 small radishes, trimmed, halved lengthwise",
        "14": "1 tablespoon fresh lemon juice"
      },
      "Instructions": "Preheat oven to 400°F. Whisk egg, grated garlic, miso, milk, berbere, and 1 tsp. salt in a large bowl. Mix in Pecorino and panko. Add beef and currants and gently mix with your hands just until all ingredients are evenly incorporated (be careful not to overmix).\nWorking one at a time, scoop out 2 heaping Tbsp. (about 1 1/2 oz.) mixture and roll into balls between your palms. Place on a foil-lined rimmed baking sheet, spacing 2\" apart (you should end up with about 15). Bake meatballs until lightly browned on top and cooked through, 20–25 minutes.\nMeanwhile, place kale in a large colander in the sink and pour 8 cups boiling water over top to wilt leaves. Run under cold water to rinse, then squeeze leaves thoroughly with your hands to remove excess liquid.\nHeat 2 Tbsp. oil in a large skillet over medium-high. Add radishes and cook, tossing occasionally, until golden and crisp-tender, 5–7 minutes. Add kale and stir, breaking up leaves, until warmed through. Push kale and radishes to one side of skillet. Pour remaining 1 Tbsp. oil on the empty side and add sliced garlic. As soon as garlic starts to sizzle, stir it into vegetables. Remove pan from heat and add lemon juice to mixture; season with salt. Toss well.\nTear meatballs in half and add to skillet along with any pan juices. Toss everything together; divide among plates.",
      "Image": "//20fix.com/xfood/img/oven-baked-beef-meatballs.jpg"
    },
    {
      "id": "1764",
      "Title": "Thai Beef Salad",
      "Ingredients": {
        "1": "1 pound (455 g) strip steak (about 1 inch/2.5 cm thick; see Tip), trimmed and at room temperature",
        "2": "Vegetable oil",
        "3": "Salt and pepper",
        "4": "1 large head of butter lettuce, also known as Boston or Bibb, leaves torn into bite-size pieces",
        "5": "1/2 English cucumber, halved lengthwise and sliced",
        "6": "1/2 pint (120 g) cherry tomatoes, halved",
        "7": "1/2 small red onion, halved lengthwise and thinly sliced",
        "8": "Handful of fresh mint leaves, roughly chopped",
        "9": "Large handful of fresh cilantro leaves, roughly chopped",
        "10": "Chile-Lime Sauce",
        "11": "Handful of roasted peanuts, whole or roughly chopped (optional)"
      },
      "Instructions": "Preheat the broiler, with a rack positioned so that the meat will be 3 to 4 inches (7.5 to 10 cm) from the heat. Line the bottom of a broiler pan with foil for easier clean-up, if you like, then top with the broiler rack. Put the meat on the broiler rack, lightly coat with the oil, and season with salt and pepper. Broil the meat for 5 to 7 minutes per side for medium-rare (err on the side of caution with the time; you can always cook it more). Transfer to a cutting board, sprinkle with salt, and let rest for 5 to 10 minutes.\nMeanwhile, in a large bowl, combine the lettuce, cucumbers, tomatoes, onions, mint, and cilantro.*\nCut the meat against the grain into very thin slices and add to the bowl. (If the meat is still hot, wait a few minutes until it is warm or it will wilt the lettuce and herbs.) Drizzle the salad with just enough Chile-Lime Sauce to lightly coat and gently toss together. Top with the peanuts, if you like.\nPrepare to *, then cover and refrigerate the lettuce mixture and the unsliced meat separately for up to 1 day. The meat can be sliced and added to the salad cold or you can warm it in a 300°F (150°C) oven, if you prefer.\nIf the salad will be served within 1 hour or so, cover the lettuce mixture and meat separately and leave them on the counter. People can help themselves and then toss their individual portions with the dressing.",
      "Image": "//20fix.com/xfood/img/thai-beef-salad.jpg"
    },
    {
      "id": "1879",
      "Title": "Ground Beef Tacos",
      "Ingredients": {
        "1": "1 tablespoon vegetable oil",
        "2": "1/2 onion, chopped",
        "3": "1/2 pound ground beef or vegetarian substitute, such as Lightlife Plant-Based Ground",
        "4": "1 garlic clove, minced",
        "5": "1 serrano chile, stemmed and chopped",
        "6": "1/2 teaspoon salt",
        "7": "1 teaspoon chili powder",
        "8": "1/4 teaspoon ground black pepper",
        "9": "1/4 teaspoon ground cumin",
        "10": "1 1/2 cups grated Cheddar or Monterey Jack cheese",
        "11": "1 1/2 cups chopped tomato",
        "12": "1 1/2 cups chopped iceberg lettuce",
        "13": "6 taco shells",
        "14": "1 cup Salsa Picante or favorite salsa, optional"
      },
      "Instructions": "Heat the oil in a skillet over medium-high heat and cook the onion until it begins to wilt, about 2 minutes. Add the meat and sear, chopping with a spatula into small pieces until the pink color is gone. Add the garlic and chile and cook for 2 minutes or until the garlic is soft. Add the salt, chili powder, black pepper, cumin, and a tablespoon of water, mix well, and cook for 2 to 3 minutes or until well blended.\nTo assemble the tacos, put 1/4 cup meat mixture, then 1/4 cup each cheese, chopped tomato, and lettuce on each taco shell. Drizzle with salsa if desired.",
      "Image": "//20fix.com/xfood/img/ground-beef-tacos.jpg"
    },
    {
      "id": "1923",
      "Title": "Somali Beef Stew with Spiced Rice (Bariis Maraq)",
      "Ingredients": {
        "1": "1/2 (3\") cinnamon stick, broken into 1/2\" pieces with the back of a chef’s knife",
        "2": "1/4 cup coriander seeds",
        "3": "1/4 cup cumin seeds",
        "4": "1 tablespoon black peppercorns",
        "5": "2 teaspoons cardamom pods",
        "6": "1/2 teaspoon whole cloves",
        "7": "1 tablespoon ground turmeric",
        "8": "2 cups basmati rice",
        "9": "6 tablespoons olive oil, divided",
        "10": "2 medium red onions, sliced, divided",
        "11": "6 garlic cloves, finely chopped, divided",
        "12": "1 pound boneless beef chuck, cut into 3/4\" pieces (about 3 cups)",
        "13": "2 tablespoons tomato paste",
        "14": "2 russet potatoes, peeled, cut into 1\" cubes (about 3 cups)",
        "15": "1 medium carrot, peeled, halved lengthwise, cut crosswise into 1/4\"-thick half-moons (about 1 cup)",
        "16": "1 red bell pepper, sliced into 1/4\" strips (about 2 cups)",
        "17": "5 teaspoons kosher salt, divided",
        "18": "1 (3\") cinnamon stick",
        "19": "4 whole cloves",
        "20": "1/4 teaspoon ground cardamom",
        "21": "1 medium tomato, sliced (about 1 cup)",
        "22": "Green or red Somali hot sauce, such as BasBaas, cilantro, lime wedges, and sliced banana (for serving)",
        "23": "A spice mill or mortar and pestle"
      },
      "Instructions": "Toast cinnamon, coriander seeds, cumin seeds, peppercorns, cardamom, and cloves in a small skillet over medium heat, stirring, until lightly browned and aromatic, 2–3 minutes. Transfer to a small bowl and let cool.\nGrind cinnamon mixture in spice mill or with mortar and pestle until finely ground. Sift through a fine-mesh sieve back into bowl, then regrind any coarse spices. Stir in turmeric and transfer to an airtight jar.\nPlace rice in a large bowl or saucepan and cover with cold water. Set aside to soak.\nHeat 2 Tbsp. oil in a large Dutch oven or saucepan over medium. Add half of onion and half of garlic and cook, stirring occasionally, until just beginning soften, about 3 minutes. Add 1 Tbsp. xawaash spice mix and cook until aromatic, about 1 minute. Add beef and tomato paste, stir to combine, then pour in 3 cups water. Cover and cook until beef is cooked through, about 30 minutes. Add potatoes, carrot, and bell pepper and continue to cook, thinning with water if needed, until beef is tender and vegetables are cooked through, about 15 minutes more. Season with 1 Tbsp. salt.\nMeanwhile, drain soaked rice. Heat remaining 1/4 cup oil in another large saucepan over medium. Add remaining onion and cook, stirring, until beginning to turn translucent, about 5 minutes. Add cinnamon, cloves, cardamom, and remaining 3 garlic cloves and cook until fragrant, about 1 minute. Add tomato and cook until tomato is cooked through and begins to break down, about 3 minutes. Add rice and cook until lightly fried, about 5 minutes.\nBring 4 cups water to a boil in a small saucepan. Add boiling water, 2 Tbsp. xawaash spice mix, and remaining 2 tsp. salt to rice mixture and stir to combine. Reduce heat to low and cook, covered, until rice is tender and liquid is absorbed, about 20 minutes. Remove from heat. Let stand, covered, 5 minutes. Fluff rice gently with a fork.\nDivide rice mixture among bowls. Spoon stew over, then top with hot sauce, cilantro, lime wedges for squeezing over, and bananas alongside.\nXawaash spice mix can be made 2 months ahead. Store in an airtight container at room temperature, or freeze up to 6 months. Stew and rice can be made 3 days ahead. Chill separately in airtight containers, or freeze up to 6 months.",
      "Image": "//20fix.com/xfood/img/somali-beef-stew-with-spiced-rice-bariis-maraq.jpg"
    },
    {
      "id": "2052",
      "Title": "Grilled Beef Wrapped in Sesame Leaves (Bo La Lot)",
      "Ingredients": {
        "1": "16 whole large Korean sesame leaves, stemmed",
        "2": "2/3 tablespoon finely minced shallots",
        "3": "1 1/3 tablespoons minced garlic",
        "4": "1/4 cup finely minced lemongrass",
        "5": "1 pound 80/20 ground chuck",
        "6": "5 2/3 teaspoons fish sauce",
        "7": "1 1/4 teaspoons five-spice powder",
        "8": "1 1/3 palm (aka coconut) sugar",
        "9": "2/3 teaspoon turmeric powder",
        "10": "6-inch bamboo skewers, presoaked in water overnight",
        "11": "Cooking oil, for brushing",
        "12": "White or black sesame seeds",
        "13": "Red bell pepper, finely diced",
        "14": "Pickled shredded carrots and daikon"
      },
      "Instructions": "Bring a pot of lightly salted water to boil over high heat. In a bowl large enough to soak sesame leaves, prepare an ice water bath.\nOnce the water is boiling, boil leaves for 5 seconds, then remove and immediately submerge in ice water bath. Remove leaves, shake off excess water, pat each leaf dry, then drip dry on a bed of paper towels. Because you’re going to use the leaves to wrap the beef, make sure to keep them as whole as possible.\nHeat wok/pan with a dash of cooking oil over medium-high heat. Sauté shallots for 3 minutes, or until they become translucent. Remove pan from heat, and immediately stir in garlic and lemongrass. Set aside and let cool to room temperature.\nIn the meantime, combine beef, fish sauce, five-spice powder, palm sugar, and turmeric in bowl. Add cooled-down sautéed aromatics (shallots, garlic, lemongrass) and mix.\nOne by one, lay out blanched sesame leaves, shiny-side up, with the top of the leaf pointing away from you. Drop a tablespoon of meat in the lower middle end of the leaf and form a small log widthwise across the stem, then fold in the sides and slowly roll up until closed. Lay flat on a tray and repeat until you’re out of beef or sesame leaves, whichever comes first.\nNext, skewer as many “logs” with two skewers (or toothpicks), keeping about 1 inch between the parallel skewers. Brush wrapped logs o’ beef with oil. Repeat until all wrapped beef is skewered and oil-brushed.\nIf you have a grill, place directly on a rack over a medium-high flame. Cook for 3 minutes per side, or until the leaves are slightly charred.\nIf you don’t have a grill, sauté in a pan over medium-high heat with some cooking oil. Make sure the pan is hot before adding the skewers—and keep the skewers in place, or the leaves will unravel as they cook.\nStack skewers on top of one another in a crisscross pattern. Garnish with sesame seeds and red bell peppers, and serve with a side of pickles to balance out the flavors.",
      "Image": "//20fix.com/xfood/img/grilled-beef-wrapped-in-sesame-leaves-bo-la-lot.jpg"
    },
    {
      "id": "2125",
      "Title": "Mini Beef and Mushroom Patties",
      "Ingredients": {
        "1": "2 medium onions, coarsely chopped",
        "2": "1 pound crimini or white button mushrooms, trimmed, coarsely chopped",
        "3": "2 pounds ground beef (preferably chuck, 20% fat)",
        "4": "2 tablespoons low-sodium soy sauce",
        "5": "2 teaspoons kosher salt",
        "6": "1 teaspoon freshly ground black pepper",
        "7": "Two (18x13\") rimmed baking sheets"
      },
      "Instructions": "Arrange racks in upper and lower thirds of oven; preheat to 450°F. Pulse onion in a food processor until very finely chopped. Transfer to paper towels and squeeze dry, then transfer to a large bowl.\nPulse mushrooms in food processor until very finely chopped. Transfer to paper towels and squeeze dry, then transfer to bowl with onions. (Alternatively, you can finely chop vegetables by hand.)\nAdd beef, soy sauce, salt, and pepper to bowl with onions and mushrooms. Mix well with your hands, then divide into 3-Tbsp.-sized portions and form into patties about 2 1/2\" in diameter and 1/2\" thick. You should have about 26 patties. Divide between baking sheets.\nBake patties 3 minutes, then flip and bake until cooked to desired doneness, 3–4 minutes more for medium/medium-well.\nPatties can be cooked 3 days ahead; wrap in plastic and chill, or freeze up to 6 months.",
      "Image": "//20fix.com/xfood/img/mini-beef-and-mushroom-patties.jpg"
    },
    {
      "id": "2231",
      "Title": "Beef Pho",
      "Ingredients": {
        "1": "1 (2 1/3-in) piece ginger, peeled and halved",
        "2": "2 cloves garlic",
        "3": "1 shallot, halved",
        "4": "6 1/3 cups beef stock",
        "5": "1 star anise",
        "6": "1 stick cinnamon",
        "7": "3 teaspoons fish sauce",
        "8": "1 tablespoon palm sugar",
        "9": "7 ounces thin brown rice noodles, cooked and drained",
        "10": "1 small white onion, thinly sliced",
        "11": "1/2 pound beef fillet, frozen for 2 hours and thinly sliced",
        "12": "Cracked black pepper",
        "13": "1 cup bean sprouts, trimmed",
        "14": "2 long red chilies, sliced",
        "15": "1/2 cup Thai basil leaves",
        "16": "1/2 cup Vietnamese mint leaves"
      },
      "Instructions": "Place the ginger, garlic, and shallot in a small non-stick frying pan over high heat and cook, turning, for 8–10 minutes or until charred. Transfer to a medium saucepan over high heat and add the stock, star anise, and cinnamon. Bring to a boil, reduce the heat to low and simmer for 10–15 minutes or until fragrant. Add the fish sauce and sugar and stir to dissolve. Strain the stock, discarding the solids, set aside and keep warm. Divide the noodles between serving bowls. Top with the onion and beef and ladle over the hot stock. Sprinkle with pepper and top with the sprouts, chile, basil and mint to serve.",
      "Image": "//20fix.com/xfood/img/beef-pho.jpg"
    },
    {
      "id": "2309",
      "Title": "Haitian Beef and Pumpkin Soup (Soup Joumou)",
      "Ingredients": {
        "1": "1 cup plus 1 tablespoon distilled white vinegar, divided",
        "2": "1 pound beef shank, meat cut off bones into 1\" cubes",
        "3": "1 pound stew beef (preferably chuck) cut into 1\" cubes",
        "4": "1 cup Epis Seasoning Base",
        "5": "3 tablespoons fresh lime juice (from about 1 lime)",
        "6": "1 tablespoon seasoned salt",
        "7": "15 cups beef or vegetable broth, divided",
        "8": "1 pound beef bones",
        "9": "1 medium calabaza squash (about 2 pounds), peeled, cubed, or 2 pounds defrosted frozen cubed calabaza squash, or 1 butternut squash (about 2 pounds), peeled, cut into 2\" chunks",
        "10": "3 large russet potatoes (about 2 pounds), finely chopped",
        "11": "3 carrots (about 1 pound), sliced",
        "12": "1/2 small green cabbage (about 1 pound), very thinly sliced",
        "13": "1 medium onion, sliced",
        "14": "1 celery stalk, coarsely chopped",
        "15": "1 leek, white and pale-green parts only, finely chopped",
        "16": "2 small turnips, finely chopped",
        "17": "1 green Scotch bonnet or habanero chile",
        "18": "1 1/2 cups rigatoni",
        "19": "6 whole cloves",
        "20": "1 teaspoon garlic powder",
        "21": "1 teaspoon onion powder",
        "22": "2 1/2 teaspoons kosher salt, plus more",
        "23": "1/2 teaspoon freshly ground black pepper, plus more",
        "24": "Pinch of cayenne pepper, plus more",
        "25": "1 parsley sprig (optional)",
        "26": "1 thyme sprig (optional)",
        "27": "2 tablespoons olive oil",
        "28": "1 tablespoon unsalted butter",
        "29": "Crusty bread (for serving)",
        "30": "A very large stock pot (at least 10 quarts)"
      },
      "Instructions": "Pour 1 cup vinegar into a large bowl. Swish beef shank and stew beef in vinegar to rinse. Transfer beef to a colander and rinse with water.\nStir Epis Seasoning Base, lime juice, and seasoned salt in another large bowl. Add beef, toss to coat, and let marinate at least 30 minutes, preferably overnight.\nHeat 5 cups broth in very large stock pot over medium. Add marinated beef and bones, cover, and simmer until meat is beginning to soften, about 40 minutes.\nAdd squash to pot on top of beef, cover, and return to a simmer. Cook until squash is fork-tender, 20–25 minutes. Using tongs or a slotted spoon, transfer squash to a blender. Add 4 cups broth and purée until smooth. Return to pot and bring to a simmer.\nAdd potatoes, carrots, cabbage, onion, celery, leek, turnips, chile, rigatoni, cloves, garlic powder, onion powder, 2 1/2 tsp. salt, 1/2 tsp. pepper, a pinch of cayenne, parsley, if using, thyme, if using, and remaining 6 cups broth. Simmer, uncovered, until pasta and vegetables are tender, 30–35 minutes.\nAdd oil, butter, and remaining 1 Tbsp. vinegar. Reduce heat to medium-low and simmer until beef is very tender, 15–20 minutes more.\nTaste and adjust seasonings. Divide soup among bowls and serve with bread alongside.\nSoup can be made 3 days ahead; cover and chill, or freeze up to 3 months.",
      "Image": "//20fix.com/xfood/img/haitian-beef-and-pumpkin-soup-soup-joumou.jpg"
    },
    {
      "id": "2350",
      "Title": "Porcini-Rubbed Beef Rib Roast",
      "Ingredients": {
        "1": "1/3 cup dried porcini mushrooms (about 1/2 ounce)",
        "2": "2 tablespoons kosher salt",
        "3": "1 tablespoon whole black peppercorns",
        "4": "1 teaspoon marjoram or oregano leaves",
        "5": "1 (4-rib) bone-in rib roast (about 10 pounds)",
        "6": "Flaky sea salt and Horseradish-Yogurt Sauce (for serving; optional)"
      },
      "Instructions": "Pulse mushrooms, kosher salt, peppercorns, and marjoram in a spice mill or mini food processor until coarsely ground. Pat meat dry, then rub mushroom mixture all over. Transfer to a wire rack set inside a rimmed baking sheet. Let sit at room temperature 1 hour (for even more flavor, chill, uncovered, overnight, then let sit at room temperature 1 hour before roasting).\nPreheat oven to 225°F. Roast meat until an instant-read thermometer inserted into the center registers 120°F (for medium-rare), about 4 hours. Tent with foil and let sit at room temperature at least 30 minutes and up to 1 hour.\nIncrease oven temperature to 500°F. Remove foil and roast meat until browned and crisp, 5–10 minutes. Immediately transfer to a cutting board. Cut off ribs in 1 piece, then slice into individual ribs. Carve roast into 1/2\" slices and arrange on a serving platter along with ribs. Season with sea salt and serve with Horseradish-Yogurt Sauce, if desired.\nRub can be made 1 day ahead; store in an airtight container at room temperature.",
      "Image": "//20fix.com/xfood/img/porcini-rubbed-beef-rib-roast.jpg"
    },
    {
      "id": "2546",
      "Title": "Beef and Potato Pasties",
      "Ingredients": {
        "1": "2 1/2 cups all-purpose flour, plus more for surface",
        "2": "2 teaspoons kosher salt, divided, plus more",
        "3": "10 1/2 tablespoons unsalted butter, divided, plus more for serving",
        "4": "3/4 pound boneless chuck steak, cut into 1/2\" cubes",
        "5": "1 medium russet potato, peeled, cut into 1/2\" cubes (about 1 1/2 cups)",
        "6": "1/2 medium onion, finely chopped (about 1 cup)",
        "7": "3/4 teaspoon freshly ground black pepper",
        "8": "1 large egg",
        "9": "Ketchup (for serving; optional)"
      },
      "Instructions": "Mix 2 1/2 cups flour and 1 tsp. salt in a large bowl. Cut 10 Tbsp. butter into cubes (it doesn't have to be particularly cold, just firm enough to cut into pieces). Work butter into flour with your fingertips until mixture resembles breadcrumbs. Pour 3/4 cup boiling water over and mix with a wooden spoon. Knead with your hands until dough just starts to form.\nTurn out onto a clean work surface and knead until dough forms, about 20 seconds; roll into a ball. Divide into 4 portions, shape into rounds, and chill until ready to use.\nPreheat oven to 375°F. Mix beef, potato, onion, pepper, and 1 tsp. salt in a large bowl.\nRoll out each round to a 9\"-diameter circle on a lightly floured work surface. Arrange a heaping 3/4 cup filling over 1 half of each circle, leaving a 1\" border between filling and edge of circle. Cut remaining 1/2 Tbsp. butter into 4 pieces; place on each mound of filling. Pull bottom half of dough over filling; crimp with your fingers to seal. (Alternately, use a fork to seal.)\nBeat egg and a pinch of salt in a small bowl. Using a pastry brush, brush each pasty with egg wash. Cut a couple small slits in top of pasty. Transfer to a parchment-lined rimmed baking sheet and bake until golden brown and bubbling, 45–60 minutes. Serve with butter and ketchup, if desired.",
      "Image": "//20fix.com/xfood/img/beef-and-potato-pasties.jpg"
    },
    {
      "id": "2604",
      "Title": "Coconut Beef Curry",
      "Ingredients": {
        "1": "1 1/2 pounds beef chuck, cut into 1 1/2-inch pieces",
        "2": "Kosher salt",
        "3": "2 tablespoons vegetable oil",
        "4": "2 tablespoons unsalted butter",
        "5": "1/2 large white onion, thinly sliced",
        "6": "4 garlic cloves, finely chopped",
        "7": "1 tablespoon finely chopped peeled ginger",
        "8": "3 tablespoons curry powder, preferably Indian",
        "9": "2 bay leaves",
        "10": "2 (13.5-ounce) cans unsweetened coconut milk",
        "11": "2 pounds Yukon Gold potatoes, peeled, cut into 2-inch pieces",
        "12": "Steamed jasmine rice, cilantro, thinly sliced Fresno chile, and lime wedges (for serving)"
      },
      "Instructions": "Season beef generously with salt. Heat oil in a large heavy pot over medium-high. Working in batches, cook beef, turning occasionally, until deeply browned all over, 8–10 minutes. Transfer to a plate.\nPour off all but 1 Tbsp. fat from pot. Reduce heat to medium; add butter, onion, garlic, and ginger and cook, stirring often and scraping up browned bits, until onion is translucent, about 5 minutes. Add curry; cook, stirring, until it starts to stick to pot, about 3 minutes. Stir in bay leaves, coconut milk, and 1 cup water. Return beef to pot. Season with salt and bring to a simmer. Cook, partially covered, until beef is just fork-tender, 30–35 minutes.\nAdd potatoes, bring to a simmer, and cook uncovered, stirring occasionally, until beef and potatoes are very tender, 25–35 minutes. Thin with water if needed; season with salt. Serve over rice, topped with cilantro, chile, and lime wedges.",
      "Image": "//20fix.com/xfood/img/coconut-beef-curry.jpg"
    }
  ],
  "t": 169,
  "p": {
    "limitstart": 0,
    "limit": 25,
    "total": 169,
    "pagesStart": 1,
    "pagesStop": 7,
    "pagesCurrent": 1,
    "pagesTotal": 7
  }
}