{
    "s": 1,
    "d": [
        {
            "id": "181",
            "Title": "Trail Mix Cookies",
            "Ingredients": {
                "1": "1½ cups assorted raw nuts and seeds",
                "2": "½ cup (60 g) old-fashioned oats",
                "3": "1 large egg",
                "4": "4 Tbsp. unsalted butter, melted",
                "5": "¼ cup (packed; 50 g) dark brown sugar",
                "6": "2 Tbsp. (25 g) granulated sugar",
                "7": "1½ tsp. vanilla extract",
                "8": "1 tsp. kosher salt",
                "9": "½ tsp. baking soda",
                "10": "¾ cup assorted dried fruit (cut into ½\u0022 pieces if large)",
                "11": "¾ cup chopped bittersweetchocolate bars or chips or disks",
                "12": "½ cup (63 g) all-purpose flour",
                "13": "Flaky sea salt"
            },
            "Instructions": "Place racks in upper and lower thirds of oven; preheat to 350°F. Toast nuts and seeds and oats on a rimmed baking sheet, tossing once, until golden brown, 10–12 minutes. Transfer to a medium bowl; let cool.\nMeanwhile, mix egg, butter, brown sugar, granulated sugar, vanilla, salt, and baking soda in a large bowl; let sit until nuts are cool (this will make for a chewier cookie).\nAdd dried fruit and chocolate to nut mixture; toss to combine. Give egg mixture a good stir, then stir in flour. Mix in nut mixture, smashing it against the sides of the bowl with a rubber spatula, until combined and mix-ins are evenly coated in dough. (It will look like too many mix-ins, but dough will come together as it chills.) Cover and chill at least 2 hours and up to 3 days.\nReheat oven to 350°F. Using a ⅓-cup measure or #16 cookie scoop, portion out dough, packing firmly, to make 12 cookies. Divide between 2 parchment-lined baking sheets as you go. Using measuring cup or your hand, press cookies into 2½\u0022-diameter disks about ¾\u0022 thick; sprinkle with sea salt.\nBake cookies, rotating baking sheets top to bottom and front to back once, until golden brown and no longer wet-looking, 11–13 minutes. Let cool on baking sheets.\nDo Ahead: Cookies can be made 1 week ahead. Store airtight at room temperature.",
            "Image": "//20fix.com/xfood/img/trail-mix-cookies.jpg"
        },
        {
            "id": "211",
            "Title": "Salty Buckwheat Chocolate Chunk Cookies",
            "Ingredients": {
                "1": "½ cup (1 stick) unsalted butter, cut into 8 equal pieces",
                "2": "1 cup (125 g) all-purpose flour",
                "3": "½ cup (63 g) buckwheat flour",
                "4": "½ tsp. baking powder",
                "5": "½ tsp. baking soda",
                "6": "1¼ tsp. Diamond Crystal or ¾ tsp. Morton kosher salt; plus more (optional)",
                "7": "⅔ cup (packed; 133 g) light brown sugar",
                "8": "½ cup (100 g) granulated sugar",
                "9": "1 large egg",
                "10": "2 large egg yolks",
                "11": "1 tsp. vanilla extract",
                "12": "6 oz. bittersweet chocolate (65% - 75% cacao) bars or wafers (disks, pistoles, fèves), coarsely chopped"
            },
            "Instructions": "Heat butter in a small saucepan over the lowest heat possible until melted (you don’t want it to sputter or brown), about 5 minutes.\nMeanwhile, whisk both flours, baking powder, baking soda, and 1¼ tsp. Diamond Crystal or ¾ tsp. Morton kosher salt in a medium bowl.\nScrape butter into a large bowl and add brown sugar and granulated sugar. Whisk vigorously until butter is absorbed into sugar, about 30 seconds. Add egg, then egg yolks, one at a time, whisking to combine after each addition; whisk in vanilla. Mixture should look much lighter in color and be almost creamy.\nAdd dry ingredients and use a rubber spatula or wooden spoon to stir until just incorporated and almost no dry streaks remain. Set aside a handful of chocolate, then add remaining chocolate to batter. Gently mix just to evenly distribute. Cover bowl with a kitchen towel (a silicone lid or plastic wrap also works) and chill 2 hours.\nPlace racks in upper and lower thirds of oven; preheat to 375°F. Line 2 baking sheets with parchment. Using a tablespoon, scoop out 2-Tbsp. portions of dough (or, if you have one, this is a leveled-off #30 cookie scoop or a heaping #40) and place 5 on each baking sheet, spacing evenly. Roll into balls and gently press 2–3 pieces of reserved chocolate onto the top of each one. It’s okay to jam the chocolate on there—some pieces can even be vertical. Cover and chill any remaining dough.\nBake cookies, rotating baking sheets top to bottom and front to back halfway through, until edges are golden brown and centers are puffed, 8–10 minutes.\nWorking one at a time, pull baking sheets out of the oven and tap lightly on the stove to deflate cookies. Sprinkle with Diamond Crystal kosher salt (if you’re using Morton, skip it: the crystals are too large). Let cookies cool on baking sheets 5 minutes, then transfer to wire racks and let cool completely.\nLet baking sheets cool, then turn parchment paper over. Repeat process with remaining dough, dividing evenly between baking sheets, to make 6–8 more cookies.\nDo Ahead: Cookies can be baked 3 days ahead. Let cool; store airtight at room temperature.",
            "Image": "//20fix.com/xfood/img/salty-buckwheat-chocolate-chunk-cookies.jpg"
        },
        {
            "id": "244",
            "Title": "Tie-Dye Butter Cookies",
            "Ingredients": {
                "1": "14 Tbsp. unsalted butter, room temperature",
                "2": "½ cup (100 g) granulated sugar",
                "3": "1¼ tsp. kosher salt",
                "4": "2 large egg yolks",
                "5": "2 tsp. vanilla extract or vanilla bean paste",
                "6": "2 cups (256 g) all-purpose flour, plus more for dusting",
                "7": "Special Equipment: Assorted (2\u0022) cookie cutters",
                "8": "2 cups (240 g) powdered sugar, divided",
                "9": "6 Tbsp. (or more) whole milk, divided",
                "10": "2 tsp. (or more) any color plant-based food-coloring powder",
                "11": "2 tsp. (or more) second color plant-based food-coloring powder",
                "12": "¼ tsp. kosher salt, divided"
            },
            "Instructions": "Using an electric mixer on high speed, beat butter, sugar, and salt in a large bowl, scraping down sides and bottom of bowl as needed, until light and creamy, about 3 minutes. Add egg yolks and vanilla and beat until incorporated, about 1 minute. Reduce speed to low, add 2 cups flour, and mix until incorporated. Dough will be semifirm but can be rolled out without chilling. If your kitchen is very warm and/or dough is sticky, pat it into a 1\u0022-thick disk, wrap in plastic, and chill 15 minutes to let firm up before rolling out.\nPlace a rack in middle of oven; preheat to 350°F. Roll out dough on a lightly floured sheet of parchment paper, dusting with more flour as needed to keep dough from sticking, to about ¼\u0022 thick. Punch out shapes as desired with lightly floured cookie cutters and transfer to 2 parchment-lined baking sheets, spacing 1½\u0022 apart. Pat scraps into a 1\u0022-thick disk, wrap with plastic, and chill 10 minutes if soft.\nBake 1 sheet of cookies, rotating halfway through, until edges are golden brown, 10–15 minutes. Let cookies cool 10 minutes on baking sheet, then transfer to a wire rack and let cool completely. Bake remaining sheet of cookies, then repeat process with remaining dough.\nDo Ahead: Dough can be made 1 month ahead; wrap tightly and freeze. Cookies can be baked 2 days ahead; store airtight at room temperature.\nWhisk 1 cup powdered sugar, 3 Tbsp. milk, 2 tsp. food-coloring powder, and half of salt in a small bowl until no lumps remain. Glaze should be the consistency of heavy cream; add more milk if needed. For a deeper color, whisk in more powder 1 tsp. at a time until desired color is achieved; adjust with milk if needed. Repeat with second food-coloring powder, remaining salt, remaining 1 cup powdered sugar, and remaining 3 Tbsp. milk, adjusting intensity of color as desired.\nSpoon 1 tsp. first glaze in the center of a small plate. Drizzle 1 tsp. second glaze over the first and use a toothpick to slightly swirl colors together; don’t go overboard. (If you want to decorate larger cookies, add 1 tsp. glaze to plate for each additional inch.)\nGently press the top of a cookie into glaze, then lift up and allow excess glaze to drip back onto the plate. Using a toothpick, pop any air bubbles and swirl colors more if desired. Transfer to a wire rack set inside a rimmed baking sheet. Repeat with 2 more cookies, adding ½ tsp. of each color of glaze to plate before each cookie is dipped. The glaze will lose its swirly effect at this point. Clean plate and repeat process, decorating cookies in batches of 3 until all cookies have been glazed. Let sit until glaze is set, at least 2 hours.\nDo Ahead: Cookies can be glazed 1 day ahead. Store tightly wrapped on a rimmed baking sheet at room temperature.",
            "Image": "//20fix.com/xfood/img/tie-dye-butter-cookies.jpg"
        },
        {
            "id": "245",
            "Title": "Ancho Mole Cookies",
            "Ingredients": {
                "1": "1 cup (140 g) nuts (such as blanched hazelnuts, blanched almonds, or walnuts)",
                "2": "1¼ cups (185 g; or more) raw sesame seeds, divided",
                "3": "⅓ cup (54 g) ancho powder (pure ground ancho chiles, not ancho chile powder, which has added salt, cumin, and other spices)",
                "4": "¼ cup agave syrup, preferably dark",
                "5": "2 cups (256 g) all-purpose flour",
                "6": "¼ tsp. baking powder",
                "7": "¼ tsp. ground cinnamon",
                "8": "12 Tbsp. unsalted butter, room temperature",
                "9": "½ cup (100 g) sugar",
                "10": "1¾ tsp. kosher salt",
                "11": "3 large egg yolks",
                "12": "1 Tbsp. vanilla extract or vanilla bean paste",
                "13": "¾ cup (130 g) dried fruit (such as papaya, mango, or pineapple), cut into (¾\u0022) pieces",
                "14": "¾ cup (110 g) bittersweet chocolate wafers (disks, pistoles, fèves; preferably 72% cacao)",
                "15": "1 large egg white, lightly beaten"
            },
            "Instructions": "Place racks in upper and lower thirds of oven; preheat to 350°F. Toast nuts and ¼ cup sesame seeds on a rimmed baking sheet on upper rack, tossing halfway through, until golden brown, 8–10 minutes. Let cool.\nStir together ancho powder and agave syrup in a small bowl. Whisk flour, baking powder, and cinnamon in a medium bowl to combine. Using an electric mixer on medium-high speed, beat butter, sugar, and salt in a large bowl, scraping down sides and bottom of bowl as needed, until light and creamy, about 3 minutes. Add egg yolks and vanilla and beat until incorporated, about 1 minute. Scrape in ancho mixture and beat until smooth and creamy, about 1 minute. Reduce speed to low, add dry ingredients, and beat to combine. Add dried fruit, chocolate, and toasted nuts and sesame seeds; mix with a wooden spoon until evenly distributed.\nDivide dough in half. Working one at a time, roll each piece into a 10\u0022-long log. Wrap each log tightly in plastic and roll across work surface to make as smooth and cylindrical as possible. Place on a rimmed baking sheet and freeze until surface is firm, about 20 minutes.\nSlap a log down onto counter to create a flat side; roll over and slap again to flatten another side (you’re aiming for a triangular shape). Repeat to create third side of the triangle. Tap against counter to smooth if needed, then tap ends to flatten. Repeat with second log. Return logs to baking sheet; freeze until firm, about 15 minutes.\nWorking one at a time, unwrap logs and brush sides with egg white. Working on baking sheet, sprinkle sides with remaining 1 cup sesame seeds and gently press to coat. Surface should be covered; use more sesame if needed. Freeze logs on baking sheet, uncovered, until surface is very firm but not frozen solid, about 1 hour.\nPreheat oven to 350°F. Slice a log crosswise into ¼\u0022-thick triangles and divide cookies between 2 parchment-lined baking sheets, spacing 1\u0022 apart. (If dough is soft or starts to lose its shape, freeze 10 minutes before continuing.) Bake cookies, rotating baking sheets top to bottom and back to front halfway through, until edges are just set, about 10 minutes. Let cool on baking sheets. Transfer cookies to a platter or airtight container and line baking sheets with fresh sheets of parchment paper. Repeat process with remaining dough.\nDo Ahead: Dough can be rolled into logs 3 days ahead; refrigerate. Transfer to freezer 30 minutes before slicing. Cookies can be baked 1 day ahead; store airtight at room temperature.",
            "Image": "//20fix.com/xfood/img/ancho-mole-cookies.jpg"
        },
        {
            "id": "248",
            "Title": "Butter Pecan Skillet Cookies",
            "Ingredients": {
                "1": "1⅓ cups (160 g) chopped pecans",
                "2": "4 Tbsp. pure maple syrup",
                "3": "2 tsp. kosher salt, divided",
                "4": "10 Tbsp. chilled unsalted butter, cut into pieces, plus more for pan",
                "5": "1¼ cups (160 g) all-purpose flour",
                "6": "6 Tbsp. (packed; 75 g) light brown sugar",
                "7": "1 large egg",
                "8": "1 Tbsp. plus 1 tsp. vanilla extract or vanilla bean paste",
                "9": "1 cup (120 g) powdered sugar",
                "10": "3 Tbsp. (or more) whole milk",
                "11": "Coarse white sanding sugar and edible glitter (for decorating)"
            },
            "Instructions": "Place a rack in middle of oven; preheat to 350°F. Toss pecans, maple syrup, and ½ tsp. salt in a medium bowl. Scrape onto a rimmed baking sheet lined with a silicone baking mat or parchment paper and spread nuts into a single layer. Bake until pecans are slightly darkened and syrup is dark and bubbling, 15–20 minutes. Remove from oven and carefully toss pecans in hot syrup to coat again. Let cool on baking sheet until caramel hardens, about 30 minutes. Break up candied pecans into pieces; discard any burned bits.\nReduce oven temperature to 325°F. Generously butter a 10\u0022 cast-iron or stainless-steel skillet; line bottom with a round of parchment paper and butter parchment. Pulse flour, brown sugar, half of candied pecans, and 1¼ tsp. salt in a food processor until nuts are finely chopped. Add egg, 1 Tbsp. vanilla, and remaining 10 Tbsp. butter and process until a shaggy dough forms.\nTransfer dough to a large bowl and knead a couple of times just to bring it together. Using damp hands, pat dough evenly into skillet, extending all the way to the sides of the pan. Bake cookie until edges are golden brown and center is slightly puffed, 30–35 minutes. Let cool in skillet 1 hour. Invert cookie onto a cutting board and cut into 16 wedges. Turn right side up and transfer to a wire rack set inside a rimmed baking sheet.\nWhisk powdered sugar, milk, remaining ¼ tsp. salt, and remaining 1 tsp. vanilla in a small wide bowl until smooth. The glaze should be the consistency of heavy cream; thin with more milk if needed. Transfer half of the glaze to another small wide bowl (you’ll need to use 2 bowls as the glaze will start to collect crumbs and you’ll want a fresh start).\nWorking one at a time, lightly dip half of the wedges, top side down, into first bowl of glaze so that only the surface is covered and no glaze drips down the sides. Use a toothpick to pop any bubbles and smooth glaze; coating should be thin enough to see the cookie peeking through. Repeat with remaining wedges and second bowl of glaze.\nTop wedges with remaining candied pecans and let sit 10 minutes. Sprinkle with sanding sugar and glitter and let sit until glaze is set, about 1 hour.\nDo Ahead: Cookies can be baked 1 day ahead. Store airtight at room temperature.",
            "Image": "//20fix.com/xfood/img/butter-pecan-skillet-cookies.jpg"
        },
        {
            "id": "276",
            "Title": "Sourdough Key Lime Ricotta Cookies",
            "Ingredients": {
                "1": "8 tbsp (113 g) unsalted butter, softened",
                "2": "1 cup (200 g) sugar",
                "3": "1 large egg",
                "4": "1⁄2 cup (120 g) leftover starter",
                "5": "1 cup (125 g) whole milk ricotta",
                "6": "Zest of 1 lime or several key limes",
                "7": "1 tsp (5 ml) pure vanilla extract",
                "8": "3 cups (360 g) all-purpose flour",
                "9": "1 tbsp (15 g) baking powder",
                "10": "1⁄2 tsp fine sea salt",
                "11": "3⁄4 cup (90 g) powdered sugar, sifted",
                "12": "Juice of 1 to 2 limes, zest reserved for decoration"
            },
            "Instructions": "Preheat your oven to 350°F (180°C). Line two sheet pans with parchment paper and set aside.\nIn the bowl of a stand mixer, cream the butter and sugar until light and fluffy, about 3 to 4 minutes. Scrape down the sides of the bowl. Add the egg and mix to combine. With the machine running, add the leftover starter, ricotta, lime zest, and vanilla. Depending on the temperature of your ingredients, the mixture may become lumpy—this is okay.\nMeanwhile, whisk the flour, baking powder, and salt together in a large bowl. On low speed, gradually add the dry ingredients and mix until just incorporated. Scrape down the sides of the bowl once more, making sure that there is no flour hiding at the bottom. It will smell wonderful. Cover the bowl in plastic wrap and chill the dough for 30 minutes to 1 hour. Then portion the dough onto your sheet pans using a tablespoon or mini ice cream scoop.\nPlace both sheet pans into the oven and bake for about 15 to 17 minutes. Rotate the pans and swap racks at the halfway mark for even coloring. When finished, the cookies will be pale yellow with golden bottoms and will feel soft to the touch. Transfer to a wire rack.\nFor the glaze, sift the powdered sugar into a small bowl. Add the juice of 1 lime and whisk until a smooth glaze forms. If the texture is too thick, add more lime juice as needed until you achieve a pourable consistency.\nOnce the cookies are completely cool, drizzle some of the glaze over the top. Finish with grated lime zest to decorate.\nThese cookies will stay fresh for up to 3 to 5 days stored in an airtight container. Alternatively, freeze for up to 2 months by placing unglazed cookies between sheets of parchment paper to prevent sticking.",
            "Image": "//20fix.com/xfood/img/sourdough-key-lime-ricotta-cookies-artisan-sourdough-made-simple.jpg"
        },
        {
            "id": "349",
            "Title": "Double Chocolate Rye Cookies",
            "Ingredients": {
                "1": "¾ cup (90 grams) walnut halves",
                "2": "9 ounces (255 gram) bittersweet chocolate",
                "3": "6 ounces (170 grams) unsweetened chocolate",
                "4": "½ cup or 1 stick (115 grams) unsalted butter",
                "5": "½ teaspoon pure vanilla extract",
                "6": "1 ½ cups (300 grams) sugar",
                "7": "4 large eggs (about 200 grams), at room temperature",
                "8": "½ cup (60 grams) rye flour",
                "9": "½ teaspoon baking powder",
                "10": "½ teaspoon kosher salt"
            },
            "Instructions": "Preheat the oven to 350°F and position a rack in the center of the oven. Place the walnuts on a baking sheet and toast for 8 to 10 minutes, until they start to smell fragrant and are lightly golden brown when you break one in half. Remove them from the oven and let cool. Roughly chop them and set aside.\nChop 5 ounces of the bittersweet chocolate and 4 ounces of the unsweetened chocolate into large chunks and place them with the butter in a metal or heatproof glass bowl. Set the bowl over a pot of simmering water and heat, stirring occasionally, until completely smooth. Remove from the heat, whisk in the vanilla, and let cool for about 20 minutes so it’s not piping hot.\nIn a stand mixer fitted with a whisk attachment, whisk together the sugar and eggs for about 5 minutes on medium-high speed, until light and thick and pale yellow. With the mixer on low, slowly add the chocolate-butter mixture and whisk for about 15 seconds. It will not be completely mixed at this point but that’s okay, because you will finish combining all the ingredients by hand.\nChop the remaining 4 ounces bittersweet chocolate into 1-inch chunks and shave the remaining 2 ounces unsweetened chocolate into fine shavings. In a medium bowl, stir together the rye flour, the chopped bittersweet chocolate, shaved unsweetened chocolate, baking powder, salt, and toasted walnuts. Remove the bowl from the mixer, add the rye flour mixture, and fold it in by hand until the dough is completely homogeneous.\nFor best results, scrape the dough into an airtight container and let it rest in the refrigerator for at least 3 to 4 hours or up to overnight before baking. (The unbaked dough can be stored in the refrigerator for up to 1 week.)\nPreheat the oven to 350°F and position a rack in the center of the oven. Line a baking sheet with parchment paper.\nDrop the dough in ¼-cup scoops onto the prepared baking sheet, spacing them about 2 inches apart. Bake for 10 to 12 minutes, rotating the baking sheet midway through the baking time, until the cookies are just starting to crack on the edges and the centers are soft but not liquidy when you press them.\nRemove the cookies from the oven and let them cool on the baking sheet on a wire rack for 5 to 10 minutes, then transfer them to the rack and let cool completely.\nThe cookies can be stored in an airtight container at room temperature for up to 3 days.",
            "Image": "//20fix.com/xfood/img/double-chocolate-rye-cookies.jpg"
        },
        {
            "id": "400",
            "Title": "Black-and-White-and-Green Cookies",
            "Ingredients": {
                "1": "2 tsp. baking powder",
                "2": "2½ cups (320 g) all-purpose flour, plus more for dusting",
                "3": "1½ tsp. kosher salt, plus more",
                "4": "2 cups (packed; 45 g) mint leaves",
                "5": "1 cup (200 g) granulated sugar",
                "6": "1¼ cups (2½ sticks) unsalted butter, room temperature",
                "7": "1 large egg",
                "8": "1 large egg yolk",
                "9": "Coarse sanding sugar or Swedish pearl sugar (for decorating)",
                "10": "1 cup (120 g) powdered sugar",
                "11": "2 Tbsp. (20 g) Dutch-process or unsweetened cocoa powder",
                "12": "1 Tbsp. light corn syrup",
                "13": "Special Equipment: A 3\u0022-diameter cookie cutter"
            },
            "Instructions": "Whisk baking powder, 2½ cups flour, and 1½ tsp. salt in a medium bowl to combine. Pulse mint and granulated sugar in a food processor until mint is finely chopped. Add butter; process to combine. Add dry ingredients and pulse again to combine. Add egg and egg yolk; pulse until a shaggy dough forms.\nTurn out dough onto a lightly floured surface and knead just until dough holds its shape. Divide dough in half; pat each portion into a 1\u0022-thick disk. Wrap disks in plastic and chill until firm, at least 2 hours.\nPlace racks in upper and lower thirds of oven; preheat to 350°F. Working with 1 disk at a time, roll out dough on a lightly floured sheet of parchment paper to about ¼\u0022 thick, dusting with more flour as needed to keep from sticking. Punch out rounds with lightly floured cookie cutter and arrange on 2 parchment-lined baking sheets, spacing 1\u0022 apart. Pat dough scraps into a 1\u0022-thick disk. Wrap in plastic and chill 10 minutes if soft. Repeat process with scraps.\nHold a bench scraper or straightedge upright 1\u0022 from edge of a cookie to cordon off a shallow semicircle (do not press down into dough; you’re just making a barrier). Coat semicircle with sanding sugar; gently press to adhere. Remove scraper; you should have a tidy sugared edge. Repeat with remaining cookies and more sanding sugar.\nBake cookies, rotating baking sheets top to bottom and back to front halfway through, until edges are lightly browned, 10–12 minutes. Let cool 10 minutes on baking sheets, then transfer to 2 wire racks set inside 2 rimmed baking sheets; let cool completely.\nSift powdered sugar and cocoa powder into a medium bowl. Add corn syrup, a pinch of salt, and 2 Tbsp. warm water and stir until smooth and glossy.\nPosition bench scraper to make another shallow semicircle on the other side of the cookie, angling it so that it forms a V with the sugared edge, lightly pressing scraper into cookie to make a barrier. Spoon 1 tsp. glaze onto exposed semicircle and use a toothpick to help coat evenly; excess will drip over sides. Lift scraper straight up and over chocolate side to create a neat edge. Repeat with remaining cookies and glaze. Let sit until glaze is set, at least 2 hours.\nDo Ahead: Dough can be made 1 month ahead; freeze. Thaw in refrigerator before using. Cookies can be baked 1 day ahead; store tightly wrapped on a rimmed baking sheet at room temperature.",
            "Image": "//20fix.com/xfood/img/black-and-white-and-green-cookies.jpg"
        },
        {
            "id": "401",
            "Title": "Chewy Ginger-Rye Cookies",
            "Ingredients": {
                "1": "1 cup (128 g) all-purpose flour",
                "2": "1¼ tsp. baking soda",
                "3": "1½ tsp. ground cinnamon",
                "4": "¼ tsp. ground cloves",
                "5": "¾ cup (110 g) plus 6 Tbsp. (60 g) rye flour, divided",
                "6": "3 tsp. ground ginger, divided",
                "7": "1¼ tsp. kosher salt, divided",
                "8": "⅓ cup (50 g) finely chopped crystallized ginger",
                "9": "⅔ cup robust-flavored (dark) molasses",
                "10": "¼ cup (packed; 50 g) dark brown sugar",
                "11": "¾ cup (1½ sticks) unsalted butter, melted, plus 2 Tbsp. unsalted butter, room temperature",
                "12": "2 large egg yolks",
                "13": "6 Tbsp. (90 g) raw sugar"
            },
            "Instructions": "Whisk all-purpose flour, baking soda, cinnamon, cloves, ¾ cup rye flour, 2 tsp. ground ginger, and 1 tsp. salt in a medium bowl to combine; add crystallized ginger and toss until coated and evenly distributed. Whisk molasses, brown sugar, and ¾ cup melted butter in a medium bowl to combine. Add egg yolks and whisk just until egg yolks are absorbed but mixture is still very dark, about 10 seconds. Add dry ingredients and fold until no streaks of flour remain. Let sit, uncovered, at room temperature 30 minutes (batter will thicken as it sits).\nMeanwhile, place a rack in middle of oven; preheat to 375°F. Whisk raw sugar, remaining 6 Tbsp. rye flour, remaining 1 tsp. ground ginger, and remaining ¼ tsp. salt in a small bowl to combine. Add remaining room-temperature butter and smash together until mixture resembles clumpy wet sand; this is your streusel topping.\nUsing a 1-oz. ice cream scoop, portion out dough (about 2 Tbsp. each) and roll into balls between your palms. Working one at a time, toss balls in streusel mixture to coat and place on 2 parchment-lined baking sheets, spacing 3\u0022 apart. Bake 1 sheet of cookies until they have spread and are slightly cracked and just set around the edges and streusel is lightly browned, 8–10 minutes. Let cool 10 minutes on baking sheet. Transfer to a wire rack and let cool completely. Bake remaining sheet of cookies.\nDo Ahead: Dough can be rolled into balls 2 weeks ahead. Freeze on a baking sheet; transfer to resealable plastic freezer bags. Let sit at room temperature 30 minutes before rolling in streusel and baking.",
            "Image": "//20fix.com/xfood/img/chewy-ginger-rye-cookies.jpg"
        },
        {
            "id": "488",
            "Title": "Pastel Butter Cookies",
            "Ingredients": {
                "1": "1 cup whole blanched almonds, toasted",
                "2": "2 cups unbleached all-purpose flour",
                "3": "½ teaspoon coarse salt",
                "4": "½ teaspoon ground cinnamon",
                "5": "2 sticks (1 cup) unsalted butter, room temperature",
                "6": "1 cup confectioners’ sugar, sifted, plus 1/2 cup per tinted sugar",
                "7": "1 teaspoon vanilla extract",
                "8": "Freeze-dried fruits in various colors, such as blueberries, raspberries, and mangoes"
            },
            "Instructions": "Preheat oven to 350°F. Place toasted almonds in the bowl of a food processor. Add flour, salt, and cinnamon, and process until nuts are finely ground, about 1 minute.\nIn a medium bowl, with an electric mixer on medium, beat butter and 1 cup confectioners’ sugar until pale and fluffy, about 4 minutes. Add vanilla and beat until combined. With mixer on low, gradually add almond mixture and beat until just incorporated.\nUsing a 1 1/2‑inch (1‑tablespoon) cookie scoop, drop dough onto parchment-lined baking sheets, spacing about 1 inch apart. Bake cookies, rotating sheets halfway through, until edges are just golden, 14 to 16 minutes. Transfer sheets to wire racks and let cool completely.\nFor each desired color, place 1/2 cup fruit with 1/2 cup confectioners’ sugar in the bowl of a food processor; process until smooth and evenly tinted. (Sugars can be stored in airtight containers up to 1 month.) Place tinted sugars in small bowls and dip cookies, domed-side down, into tinted sugars to coat. Transfer to a plate and let rest, about 30 minutes. (Cookies can be stored in an airtight container at room temperature up to 1 week.)",
            "Image": "//20fix.com/xfood/img/pastel-butter-cookies.jpg"
        },
        {
            "id": "489",
            "Title": "Iranian Rice Cookies",
            "Ingredients": {
                "1": "1 1/2 sticks (3/4 cup) unsalted butter",
                "2": "1/4 cup sugar",
                "3": "1/8 teaspoon rose water",
                "4": "1 large egg yolk",
                "5": "1/2 cup unbleached all-purpose flour",
                "6": "3/4 cup white rice flour, plus more for dusting",
                "7": "1/2 teaspoon ground cardamom, preferably fresh",
                "8": "1/2 teaspoon coarse salt"
            },
            "Instructions": "Preheat oven to 350°F. Line a fine-mesh sieve with 4 layers of cheesecloth; set over a small liquid measuring cup. Melt butter in a small saucepan over medium-high heat until beginning to boil. Reduce heat to medium and simmer until foamy, stirring occasionally, until butter turns golden brown with a nutty aroma, and milk solids separate into brown specks that sink to bottom, 5 to 7 minutes. Remove saucepan from heat and strain butter through prepared sieve, leaving solids behind. Let cool slightly.\nIn another small saucepan over medium heat, stir together sugar and 2 tablespoons water until sugar has dissolved; transfer to a large bowl. Let cool slightly. Add rose water and stir to combine.\nAdd egg yolk to sugar mixture; whisk until light and slightly thickened. Continue whisking and drizzle in strained brown butter until thick and incorporated. In a medium bowl, whisk together both flours, the cardamom, and salt. Add to brown butter mixture and stir until incorporated.\nRoll or scoop dough into 11/2‑inch balls and place about 1 inch apart on parchment-lined baking sheets. Imprint each ball with the grooved side of a meat mallet, pressing to 1/4 inch thick. Dust mallet with rice flour as needed to prevent sticking. Bake, rotating sheets halfway through, until edges of cookies just turn light golden, 16 to 18 minutes. Transfer cookies to wire racks to cool completely. (Cookies can be stored in an airtight container at room temperature up to 3 days.)",
            "Image": "//20fix.com/xfood/img/iranian-rice-cookies.jpg"
        },
        {
            "id": "519",
            "Title": "Chocolate-Hazelnut Cookies",
            "Ingredients": {
                "1": "¾ cup (115 g) blanched hazelnuts",
                "2": "3½ cups (440 g) all-purpose flour",
                "3": "1 tsp. kosher salt",
                "4": "¾ tsp. baking powder",
                "5": "½ tsp. baking soda",
                "6": "½ tsp. ground ginger",
                "7": "1 cup (2 sticks) unsalted butter, room temperature",
                "8": "½ cup (100 g) granulated sugar",
                "9": "½ cup (100 g) raw sugar or granulated sugar",
                "10": "½ cup (100 g) (packed) light brown sugar",
                "11": "2 large eggs, room temperature",
                "12": "¼ cup honey",
                "13": "½ tsp. vanilla extract",
                "14": "4 (2-oz.) bittersweet chocolate bars, cut lengthwise into ¼\u0022-thick sticks",
                "15": "Flaky sea salt"
            },
            "Instructions": "Place racks in upper and lower thirds of oven; preheat to 300°F. Toast hazelnuts on a rimmed baking sheet on upper rack, tossing halfway through, until golden brown, 8–10 minutes. Let cool slightly, then chop very coarsely; set aside. Increase oven temperature to 350°F.\nWhisk flour, kosher salt, baking powder, baking soda, and ginger in a large bowl to combine. Beat butter, granulated sugar, raw sugar, and brown sugar in the bowl of a stand mixer fitted with the paddle attachment on high speed, scraping down sides of bowl occasionally, until pale and fluffy, 5–7 minutes. Reduce speed to medium-high and add eggs, one at a time, increasing speed to high after each addition to fully incorporate and stopping periodically to scrape down sides of bowl. Add honey and vanilla and beat just to combine. Reduce speed to low and add dry ingredients; beat until combined. Add chocolate and reserved nuts and beat just until incorporated.\nScoop dough into 1½-oz. portions (about 3 Tbsp.); roll into balls (if the batter feels loose or sticky, chill 30 minutes). Place on a parchment-lined baking sheet. Chill until firm, at least 2 hours.\nArrange chilled cookies on 2 fresh parchment-lined baking sheets, spacing 2\u0022 apart; you should be able to fit about 12 cookies on each. Sprinkle cookies with sea salt. Bake, rotating top to bottom and front to back halfway through, until bottoms and edges are golden brown, 12–15 minutes. Let cool on baking sheets. Place a fresh sheet of parchment on 1 baking sheet and repeat process with remaining balls of dough.\nDo Ahead: Dough can be made 1 month ahead. Transfer chilled balls to resealable freezer bags and freeze. Bake from frozen.",
            "Image": "//20fix.com/xfood/img/chocolate-hazelnut-cookies.jpg"
        },
        {
            "id": "544",
            "Title": "Salty-Sweet Fall Cookies",
            "Ingredients": {
                "1": "4 1/2 cups all-purpose ﬂour, plus more for rolling",
                "2": "1 Tbsp baking powder",
                "3": "1 1/2 cups salted butter, at room temperature",
                "4": "1 1/2 cups white granulated sugar",
                "5": "3 large eggs",
                "6": "1 Tbsp pure vanilla extract",
                "7": "1 1/2 cups chopped chocolate-covered pretzels",
                "8": "Milk chocolate candy melts",
                "9": "1 1/2-inch square cookie cutter"
            },
            "Instructions": "Whisk the ﬂour and baking powder together in a medium bowl.\nBeat the butter and sugar together in a large bowl with an electric mixer ﬁtted with the paddle attachment on medium speed until smooth or about 2 1/2 minutes. Beat in the eggs and vanilla until ﬂuffy, about 1 minute. Scrape the sides of the bowl with a rubber spatula.\nTurn the mixer speed to low and add the ﬂour mixture approximately a quarter at a time, scraping the sides of the bowl after each addition. Reserve 1/4 cup of the chocolate-covered pretzels. Mix the remaining pretzels into the cookie dough until fully incorporated. The dough will form a ball around the paddle attachment and feel soft but not sticky.\nWrap the dough ball in a piece of plastic wrap and press down to form a 1-inch thick disk. Refrigerate for at least 10 minutes, or store for up to 7 days tightly wrapped.\nPreheat the oven to 375°F.\nRoll out the dough on a lightly ﬂoured ﬂat work surface to about 1/4-inch thickness, using additional ﬂour as necessary to prevent sticking. Use cookie cutters to create the shapes you want, and carefully transfer with a metal spatula to a nonstick baking sheet, placing the cookies about 3/4 inch apart.\nBake one sheet at a time on the middle rack about 7 to 8 minutes, until puffy. Let the cookies rest for 2 minutes before transferring to a wire rack to cool.\nMelt the candy melts in a microwave-safe bowl on 30 percent power for 30-second increments until melted.\nUsing a honey dipper, drizzle the chocolate over the cookies and sprinkle with the reserved chocolate-covered pretzels.",
            "Image": "//20fix.com/xfood/img/salty-sweet-fall-cookies.jpg"
        },
        {
            "id": "787",
            "Title": "Black Bottom Brownie Cookies",
            "Ingredients": {
                "1": "1 cup plus 2 Tbsp. (225 g) sugar",
                "2": "3/4 cup plus 2 Tbsp. (80 g) unsweetened cocoa powder",
                "3": "10 Tbsp. unsalted butter, cut into small pieces",
                "4": "3/4 tsp. kosher salt",
                "5": "1/2 tsp. vanilla extract",
                "6": "2 cold large eggs",
                "7": "1/2 cup (65 g) all-purpose flour",
                "8": "3 Tbsp. (42 g) sugar",
                "9": "1 1/2 tsp. (6 g) cornstarch",
                "10": "1/4 tsp. kosher salt",
                "11": "4 oz. cream cheese, room temperature",
                "12": "1 1/4 oz. chopped bittersweet chocolate (about 1/4 cup)",
                "13": "Flaky sea salt"
            },
            "Instructions": "Heat sugar, cocoa, butter, and kosher salt in a medium heatproof bowl set over a medium pot of barely simmering water (do not let bowl touch water), stirring occasionally, until butter is melted and mixture is hot enough that you want to remove your finger fairly quickly after dipping it in to test, about 15 minutes. (Don’t worry if it looks gritty.) Let cool until mixture is warm, not hot, about 5 minutes.\nStir in vanilla with a wooden spoon. Add eggs one at a time, stirring vigorously after each addition, until mixture looks thick and glossy. Add flour and mix until combined, then beat vigorously with wooden spoon or a rubber spatula until shiny and homogenous, about 1 minute.\nCover bowl with plastic wrap and freeze at least 8 hours or up to overnight.\nWhisk sugar, cornstarch, and kosher salt to combine in a small bowl.\nUsing an electric mixer on medium-high speed, beat cream cheese in a large bowl until smooth. Add sugar mixture and continue to beat until well combined. Fold in chocolate. Cover bowl with plastic wrap and freeze until very firm, at least 8 hours or up to overnight.\nPlace racks in top and bottom thirds of oven; preheat to 350°F. Line two rimmed baking sheets with parchment paper or silicone mats. Let dough sit at room temperature 5–10 minutes.\nUsing a spoon dipped in hot water, scoop 20 balls of dough (about 1 1/2 Tbsp. each) and roll into smooth balls with your hands. Using your thumb, make an imprint in center of ball, then fill each indent with about 1 tsp. cream cheese filling. Using your fingers, flatten edges of dough to about a 3\u0022 circle with the filling in the middle (like you’re making a dumpling). Fold dough over filling to cover completely; pinch to seal. Arrange on prepared sheets, spacing at least 3\u0022 apart. For best results, freeze dough 10 minutes.\nBake cookies, rotating pans halfway through, until edges are set and firm (the centers may be a little shiny and wet-looking), 12–14 minutes. Sprinkle cookies with sea salt while still warm, then let cool on baking sheets until firm. Transfer to a wire rack and let cool completely.\nDo Ahead: Cookies can be baked 2 days ahead. Store in an airtight container and chill. Assembled unbaked cookies can be made 2 months ahead. Freeze on baking sheets, then transfer to freezer bags and keep frozen.",
            "Image": "//20fix.com/xfood/img/black-bottom-brownie-cookies.jpg"
        },
        {
            "id": "792",
            "Title": "Vegan Matcha Almond Thumbprint Cookies",
            "Ingredients": {
                "1": "1 1/2 teaspoons Ener-G Egg Replacer",
                "2": "2 tablespoons water, lukewarm",
                "3": "3/4 cup almond paste",
                "4": "1/2 cup agave nectar",
                "5": "5 tablespoons Earth Balance",
                "6": "1/2 teaspoon vanilla extract",
                "7": "1/2 teaspoon almond extract",
                "8": "1 1/4 cups flour",
                "9": "1/4 teaspoon salt",
                "10": "1 tablespoon matcha powder",
                "11": "2 tablespoons Silk vanilla creamer",
                "12": "1/2 cup Earth Balance vegan butter, at room temperature",
                "13": "3 cups powdered sugar, sifted"
            },
            "Instructions": "Preheat the oven to 325°F. Lightly grease a cookie sheet and set aside. In a small bowl, stir together the egg replacer and water and set aside. Using an electric mixer, beat the almond paste, agave nectar, and Earth Balance until creamy. Add the extracts and the egg replacer mixture and continue beating. Stir in the flour and salt to create a soft dough.\nUsing a teaspoon, create small balls of cookie dough and drop them on the prepared cookie sheet, leaving plenty of room between cookies. Push your thumb down into each cookie to create an imprint. Bake for 15 minutes, until the edges begin to harden. Transfer the cookies to a wire rack and allow them to cool.\nFor the frosting, mix the matcha powder with the creamer in a small bowl to create a paste. In a medium bowl, beat the Earth Balance briefly and scrape the bowl. Add the powdered sugar and matcha paste, and beat again until smooth. Once the cookies have cooled, use a teaspoon to scoop some matcha frosting into each thumbprint.",
            "Image": "//20fix.com/xfood/img/vegan-matcha-green-tea-almond-thumbprint-cookies.jpg"
        },
        {
            "id": "856",
            "Title": "Chocolate-Tahini Linzer Cookies",
            "Ingredients": {
                "1": "1 1/2 cups all-purpose flour",
                "2": "3/4 cup Dutch-process cocoa powder",
                "3": "3/4 tsp. baking powder",
                "4": "1 tsp. kosher salt, plus more",
                "5": "1 cup granulated sugar",
                "6": "3/4 cup (1 1/2 sticks) unsalted butter, room temperature",
                "7": "1 large egg",
                "8": "1 tsp. vanilla extract",
                "9": "White sanding sugar (for sprinkling)",
                "10": "1/2 cup white, milk, or dark chocolate chips or wafers (disks, pistoles, fèves)",
                "11": "2 Tbsp. tahini",
                "12": "Assorted 2\u0022–3\u0022and 1\u0022–1 1/2\u0022 cookie cutters"
            },
            "Instructions": "Whisk flour, cocoa powder, baking powder, and 1 tsp. salt in a medium bowl to combine. Beat granulated sugar and butter in the bowl of a stand mixer fitted with paddle attachment on medium-high speed until light and fluffy, about 4 minutes. Add egg and vanilla and beat to incorporate, about 1 minute. Reduce speed to low and add dry ingredients. Beat just until dough comes together. Divide in half and pat each into a disk; wrap tightly in plastic. Chill just long enough that dough is rollable and no longer sticky, about 30 minutes.\nWorking one at a time, roll out dough between 2 sheets of parchment paper until 1/8\u0022 thick. Slide onto baking sheets, still sandwiched between parchment, and chill until very firm, about 1 hour.\nPlace racks in upper and lower thirds of oven; preheat to 350°F. Carefully peel away top sheets of parchment from dough and punch out cookies with larger cutters. Punch out centers of half of cookies with smaller cutters. Carefully transfer whole cookies with a spatula to a parchment-lined baking sheet, spacing 1\u0022 apart. Sprinkle remaining cut-out cookies with sanding sugar, then transfer to another parchment-lined baking sheet. Bake cookies until edges are set, 7–10 minutes. Let cool on baking sheets. Repeat process with scraps (chill dough again before punching out shapes).\nMelt chocolate and tahini in a bowl in a microwave in 20-second bursts, stirring after each, until chocolate is melted (or melt in a heatproof bowl set over a saucepan of simmering water; do not let bowl touch water). Stir to combine and season with salt. Spread filling over whole cookies; top with cut-out cookies.\nCookies can be assembled 5 days ahead. Store airtight at room temperature.",
            "Image": "//20fix.com/xfood/img/chocolate-tahini-linzer-cookies.jpg"
        },
        {
            "id": "869",
            "Title": "Zebra-Striped Shortbread Cookies",
            "Ingredients": {
                "1": "2 1/3 cups all-purpose flour, divided",
                "2": "1 1/2 tsp. kosher salt, divided",
                "3": "1/3 cup Dutch-process cocoa powder",
                "4": "1 1/4 cups (2 1/2 sticks) unsalted butter, room temperature",
                "5": "2/3 cup granulated sugar",
                "6": "1/4 cup powdered sugar",
                "7": "1 large egg yolk",
                "8": "1 tsp. vanilla extract or paste",
                "9": "1 large egg, beaten to blend",
                "10": "1/4 cup sanding sugar (any color)"
            },
            "Instructions": "Whisk 1 1/3 cups flour and 3/4 tsp. salt in a medium bowl. Whisk cocoa powder, remaining 1 cup flour, and remaining 3/4 tsp. salt in another medium bowl. These are the bases for your chocolate and vanilla doughs.\nBeat butter, granulated sugar, and powdered sugar in the bowl of a stand mixer on medium-high speed until light and fluffy, about 4 minutes. Add egg and vanilla and beat until smooth. Divide mixture between the 2 bowls of dry ingredients (about 1 cup in each). Scrape vanilla mixture back into stand mixer bowl (save the mixing bowl) and beat on low speed just until combined. Return to reserved bowl. Repeat process with chocolate mixture.\nArrange 2 large sheets of parchment paper on a work surface. Dollop one-quarter of chocolate dough in the center of each sheet and pat into rough 6x2\u0022 rectangles. Dollop one-quarter of vanilla dough on top of each chocolate slab and pat into rectangles the same size and shape so that you have 2 layers each. Repeat entire process so you have 4 alternating layers. Tightly press stacked dough into cylinders about 1 1/2\u0022 wide and 8\u0022 long, using the parchment to help you. Wrap logs in plastic wrap and chill until very firm, at least 2 hours.\nPlace racks in upper and lower thirds of oven; preheat to 350°F. Working one at a time, unwrap dough and brush with egg. Carefully sprinkle surface with sanding sugar and roll logs in sugar to coat well (really press dough into sugar so it sticks). Slice into rounds a generous 1/4\u0022 thick, rotating after every few cuts to keep slices round. Arrange cookies on parchment-lined baking sheets, spacing 2\u0022 apart. Bake, rotating baking sheets top to bottom and front to back halfway through, until edges are just set, 12–14 minutes. Let cool on baking sheets.\nDough can be made 3 days ahead; keep chilled. Cookies can be baked 5 days ahead; store airtight at room temperature.",
            "Image": "//20fix.com/xfood/img/zebra-striped-shortbread-cookies.jpg"
        },
        {
            "id": "873",
            "Title": "Snickerdoodle Party Cookies",
            "Ingredients": {
                "1": "1 cup (2 sticks) unsalted butter",
                "2": "2 cups all-purpose flour",
                "3": "1 tsp. baking soda",
                "4": "1 tsp. kosher salt",
                "5": "2 1/2 tsp. ground cardamom, divided",
                "6": "2 tsp. ground cinnamon, divided",
                "7": "1 cup (packed) light brown sugar",
                "8": "1/2 cup granulated sugar, divided",
                "9": "2 large eggs",
                "10": "1 tsp. vanilla extract or paste",
                "11": "2 Skor bars, finely chopped",
                "12": "3 cups cornflakes, lightly crushed",
                "13": "Gold or rainbow disco or luster dust (for serving; optional)"
            },
            "Instructions": "Place racks in upper and lower thirds of oven; preheat to 350°F. Cook butter in a medium saucepan over medium heat, stirring often, until it foams, then browns, 5–8 minutes. Scrape into the bowl of a stand mixer. Let brown butter cool slightly.\nMeanwhile, whisk flour, baking soda, salt, 1 1/2 tsp. cardamom, and 1 tsp. cinnamon in a medium bowl.\nAdd brown sugar and 1/4 cup granulated sugar to brown butter. Fit bowl onto stand mixer fitted with paddle attachment and beat on medium speed until thick, about 1 minute. Add eggs one at a time, beating well after each addition. Continue to mix just until smooth, about 1 minute longer. Beat in vanilla. Reduce speed to low and add dry ingredients; beat until nearly combined. Add Skor bars and beat just long enough to bring dough together (it will be a little loose). Cover and let rest 5–10 minutes to let flour hydrate (dough will thicken).\nPlace cornflakes in a small bowl. Mix remaining 1/4 cup granulated sugar, 1 tsp. cardamom, and 1 tsp. cinnamon in another small bowl. Working one at a time, scoop out 2-tablespoonfuls of dough (they don’t need to be perfect balls) and toss in cornflakes to coat well; squeeze lightly to adhere. Move to bowl with spiced sugar and toss to coat. Divide between 2 parchment-lined baking sheets, spacing 3\u0022 apart.\nBake cookies, rotating baking sheets top to bottom and front to back halfway through, until edges are set, 13–16 minutes. Let cool on baking sheets. Brush with gold dust if desired.\nCookies can be baked 5 days ahead. Store airtight at room temperature.",
            "Image": "//20fix.com/xfood/img/snickerdoodle-party-cookies.jpg"
        },
        {
            "id": "910",
            "Title": "Molasses Sandwich Cookies with Coffee Cream",
            "Ingredients": {
                "1": "2 1/4 cups all-purpose flour",
                "2": "1 Tbsp. finely ground coffee or espresso",
                "3": "1 3/4 tsp. baking soda",
                "4": "1 1/2 tsp. ground cinnamon",
                "5": "1/2 tsp. ground ginger",
                "6": "1/2 tsp. kosher salt",
                "7": "1/4 tsp. ground allspice",
                "8": "3/4 cup (1 1/2 sticks) unsalted butter, melted, cooled",
                "9": "1/2 cup (packed) dark brown sugar",
                "10": "1/4 cup mild-flavored (light) molasses",
                "11": "3/4 cup granulated sugar, plus more for rolling",
                "12": "1 large egg",
                "13": "3 Tbsp. unsalted butter, cut into pieces",
                "14": "8 oz. blond chocolate, such as Dulcey, or milk chocolate, divided",
                "15": "3/4 cup heavy cream",
                "16": "2 tsp. finely ground coffee or espresso",
                "17": "1/2 tsp. vanilla extract",
                "18": "1/4 tsp. kosher salt"
            },
            "Instructions": "Whisk flour, coffee, baking soda, cinnamon, ginger, salt, and allspice in a medium bowl.\nWhisk butter, brown sugar, molasses, and 3/4 cup granulated sugar in a large bowl until smooth (it may stiffen and separate at first; keep whisking until it loosens up). Whisk in egg.\nAdd dry ingredients to butter mixture. Mix with a silicone spatula or wooden spoon just until combined. Cover and chill dough until firm, at least 20 minutes or up to overnight.\nPlace a rack in middle of oven; preheat to 375°F. Place granulated sugar in a shallow bowl. Working with about one-quarter of dough and chilling remaining dough while you assemble and bake, scoop dough by the tablespoonful and roll into balls; you should get 10 per batch. It’s important to bake only 1 sheet of cookies at a time; they’re very temperature-sensitive and will spread too much otherwise. Roll balls in granulated sugar, then arrange on a parchment-lined baking sheet, spacing 2\u0022 apart.\nBake cookies until centers are cracked and edges are set, 5–7 minutes. Resist the urge to bake the cookies longer; the aim is to maintain their chew and they will continue to crisp as they cool. If cookies are puffed, tap pan against counter as soon as they come out of the oven to deflate. Transfer pan to a wire rack and let cool 5 minutes. Remove cookies from pan and let cool completely. Repeat with remaining dough for a total of 4 batches and 40 cookies.\nDough can be made 1 day ahead. Keep chilled. Unfilled cookies can be made 5 days ahead. Store in an airtight container at room temperature.\nPlace butter and 6 oz. chocolate in a large bowl. Bring cream just to a boil in a small saucepan over medium-high heat. Remove from heat, then stir in coffee, vanilla, and salt. Pour hot cream mixture over chocolate and butter and whisk until smooth. Chill until ganache is cooled and thickened, about 20 minutes. Beat with an electric mixer or vigorously by hand with a whisk until lightened in color and stiff.\nMelt remaining 2 oz. chocolate in a small saucepan over medium-low heat. Transfer to a pastry bag and snip off end of bag (or use a resealable plastic bag and cut off 1 corner) to make a very small opening.\nPlace 1 rounded tablespoon of filling on half of cookies. Press remaining cookies on top. Pipe thin lines of melted chocolate over in desired design.\nFilled cookies can be made 2 days ahead. Store in an airtight container at room temperature.",
            "Image": "//20fix.com/xfood/img/molasses-sandwich-cookies-with-coffee-cream.jpg"
        },
        {
            "id": "1061",
            "Title": "Oatmeal Cookie Energy Bites",
            "Ingredients": {
                "1": "1 1/2 cups rolled oats",
                "2": "2/3 cup peanut butter",
                "3": "1/2 cup raisins",
                "4": "1/4 cup pure maple syrup",
                "5": "1/2 teaspoon ground cinnamon"
            },
            "Instructions": "In a large bowl, combine all the ingredients and stir until well mixed.\nRoll into 18 bite-size balls with wet hands to keep the mixture from sticking to you (or use a melon scooper to help). Store in the refrigerator for up to 1 week.",
            "Image": "//20fix.com/xfood/img/oatmeal-cookie-energy-bites.jpg"
        },
        {
            "id": "1117",
            "Title": "Matcha–Chocolate Chip Cookies",
            "Ingredients": {
                "1": "Nonstick olive or coconut oil cooking spray",
                "2": "3/4 cup gluten-free flour",
                "3": "1/2 teaspoon aluminum-free baking powder",
                "4": "1/4 teaspoon sea salt",
                "5": "3 tablespoons unrefined coconut oil, melted",
                "6": "1 teaspoon organic vanilla extract",
                "7": "1/3 cup organic sugar (or 5 drops of stevia)",
                "8": "1 egg (if making vegan, add 1 to 2 tablespoons of water)",
                "9": "1 1/2 ripe medium bananas, mashed",
                "10": "1/2 cup organic rolled oats",
                "11": "1 cup semisweet chocolate chips",
                "12": "1 tablespoon matcha powder, sifted"
            },
            "Instructions": "Preheat the oven to 325°F. Line a rimmed baking sheet with aluminum foil and coat lightly with cooking spray.\nIn a medium bowl, whisk together the flour, baking powder, and salt; set aside.\nIn a large bowl, whisk together the coconut oil, vanilla, and sugar (or stevia) to combine. Add the egg (or water) and whisk well to incorporate.\nUsing a rubber spatula, scrape down the sides and bottom of the bowl as necessary. Mix in the mashed banana and stir until well incorporated.\nAdd the dry ingredients to the wet ingredients and stir until combined. Using a rubber spatula, fold in the oats and chocolate chips. Sprinkle in the sifted matcha powder and fold in gently.\nChill the cookie dough in the refrigerator for 15 minutes.\nUsing a tablespoon, scoop out 1 1/2-inch balls and place them about 1 inch apart on the prepared baking sheet. Bake until lightly golden on top, 10 to 13 minutes. Cool on the baking sheet for 5 minutes before transferring the cookies to a wire rack to cool completely.",
            "Image": "//20fix.com/xfood/img/matchachocolate-chip-cookies.jpg"
        },
        {
            "id": "1236",
            "Title": "Tiramisù with Amaretti Cookies",
            "Ingredients": {
                "1": "6 large egg yolks",
                "2": "1/2 cup sugar",
                "3": "3 cups mascarpone",
                "4": "3 Tbsp. dark rum",
                "5": "1/4 tsp. kosher salt",
                "6": "1 cup espresso or very strong coffee",
                "7": "1 (7-oz.) bag amaretti cookies (Italian macaroons; about 4 cups)",
                "8": "2 Tbsp. unsweetened cocoa powder",
                "9": "8 (6-oz.) glasses or ramekins"
            },
            "Instructions": "Whisk egg yolks in a medium bowl to blend, then gradually add sugar, whisking constantly until mixture is thick, smooth, and pale yellow. Using a rubber spatula, gently fold in mascarpone, rum, and salt; set aside.\nPlace espresso in a small bowl. Working in batches, gently mix and turn cookies in espresso 20 seconds to soak. Divide cookies among glasses and top each with 1/2 cup mascarpone mixture. Chill at least 1 hour.\nDust tiramisù with cocoa powder just before serving.\nTiramisù can be made 1 day ahead. Cover and keep chilled.",
            "Image": "//20fix.com/xfood/img/tiramisu-with-amaretti-cookies.jpg"
        },
        {
            "id": "1350",
            "Title": "Salted-Butter Oatmeal Chocolate Chip Cookies",
            "Ingredients": {
                "1": "1 1/2 cups all-purpose flour",
                "2": "1/2 cup whole wheat flour",
                "3": "1 tsp. baking powder",
                "4": "1/2 tsp. baking soda",
                "5": "1 tsp. kosher salt",
                "6": "1 cup (2 sticks) salted butter, room temperature",
                "7": "1 1/2 cups (packed) light brown sugar",
                "8": "1/2 cup granulated sugar",
                "9": "2 large eggs",
                "10": "2 cups old-fashioned oats",
                "11": "1 Tbsp. vanilla extract",
                "12": "6 oz. semisweet chocolate (at least 60% cacao), chopped"
            },
            "Instructions": "Whisk all-purpose flour, whole wheat flour, baking powder, baking soda, and salt in a medium bowl.\nUsing an electric mixer on medium speed, beat butter, brown sugar, and granulated sugar in a large bowl until light and fluffy, 3–4 minutes. Add eggs one at a time, beating after each addition to incorporate before adding the next. Reduce mixer speed to low and gradually add dry ingredients, beating until just incorporated. Add oats and vanilla and beat just to combine. Fold in chocolate with a spatula.\nTurn dough out onto a work surface and flatten to a disk. Freeze 15–20 minutes to prevent dough from spreading too much as it bakes, or ideally chill 24–36 hours.\nMeanwhile, place racks in upper and lower thirds of oven; preheat to 350°F. Line 2 rimmed baking sheets with parchment paper.\nDrop 1/4 cupfuls of dough onto prepared sheets. Bake cookies, rotating sheets front to back and top to bottom halfway through, until just golden brown around the edges, 12–15 minutes (cookies will firm up as they cool). Let cookies cool on baking sheets 5 minutes, then transfer to wire racks and let cool completely. Let baking sheet cool completely before lining with fresh parchment and spooning on dough for third batch.\nDo Ahead: Dough can be made 3 months ahead. Wrap tightly with plastic and freeze. Cookies can be made 1 day ahead. Store in an airtight container at room temperature, or freeze up to 3 months.",
            "Image": "//20fix.com/xfood/img/salted-butter-oatmeal-chocolate-chip-cookies.jpg"
        },
        {
            "id": "1354",
            "Title": "Oatmeal Chocolate Chunk Lactation Cookies",
            "Ingredients": {
                "1": "3 cups old-fashioned oats",
                "2": "1 cup whole wheat flour",
                "3": "3/4 cup all-purpose flour",
                "4": "5 Tbsp. brewer’s yeast powder",
                "5": "1/4 cup ground flaxseed",
                "6": "3 Tbsp. white chia seeds",
                "7": "1 tsp. ground cinnamon",
                "8": "1/2 tsp. aluminum-free baking powder",
                "9": "1/2 tsp. baking soda",
                "10": "1/4 tsp. fine sea salt",
                "11": "1 1/4 cups sugar",
                "12": "6 Tbsp. virgin coconut oil, melted, cooled slightly",
                "13": "6 Tbsp. unsalted butter, room temperature",
                "14": "2 large eggs",
                "15": "2 1/2 tsp. vanilla extract",
                "16": "6 Tbsp. unsweetened applesauce",
                "17": "1 1/2 cups semisweet chocolate chips",
                "18": "3/4 cup dried cranberries (optional)",
                "19": "3/4 cup unsweetened coconut flakes (optional)",
                "20": "Nonstick vegetable oil spray",
                "21": "Flaky sea salt"
            },
            "Instructions": "Mix oats, whole wheat flour, all-purpose flour, yeast powder, flaxseed, chia seeds, cinnamon, baking powder, baking soda, and 1/4 tsp. fine sea salt in a large bowl.\nUsing an electric mixer on medium speed, beat sugar, coconut oil, and butter in another large bowl, scraping down sides as needed, until fluffy, about 5 minutes. Add eggs and vanilla and beat until incorporated, about 4 minutes. Add applesauce and beat for just a few seconds (it will break the mixture slightly and look lumpy; that’s okay).\nReduce mixer speed to low. Gradually add dry ingredients and beat just to combine. Using a wooden spoon, stir in chocolate chips, cranberries, and coconut flakes (if using). Chill dough at least 1 hour and up to overnight.\nPreheat oven to 350°F. Line a rimmed baking sheet with parchment paper. Coat parchment with nonstick spray.\nUsing a 1/4-cup (2.5-oz.) scoop, portion dough on prepared baking sheet, spacing 1\u0022–2\u0022 apart (you’ll get 6 per sheet). Flatten top of each cookie with your hand, then season lightly with flaky sea salt. Bake cookies until golden brown, 12–14 minutes.\nLet cookies cool on baking sheets about 5 minutes, then transfer to a wire rack and let cool completely (if moved immediately, they will crack and start to break apart). Repeat with remaining dough.\nDo Ahead: Cookies can be made 5 days ahead. Store in an airtight container at room temperature, or place in a freezer-safe bag and freeze up to 1 month. Reheat by microwaving on low about 1 minute.",
            "Image": "//20fix.com/xfood/img/oatmeal-chocolate-chunk-lactation-cookies.jpg"
        },
        {
            "id": "1467",
            "Title": "Chocolate Chip, Peanut Butter, and Banana Cookies",
            "Ingredients": {
                "1": "3/4 cup all-purpose flour",
                "2": "1/2 teaspoon kosher salt",
                "3": "1/2 teaspoon baking soda",
                "4": "1 banana, thinly sliced",
                "5": "2 tablespoons all-natural peanut butter",
                "6": "1/2 cup unsweetened applesauce",
                "7": "1 teaspoon pure vanilla extract",
                "8": "2 cups old-fashioned rolled oats",
                "9": "2/3 cup semisweet chocolate chips"
            },
            "Instructions": "Preheat the oven to 350°F. Line two baking sheets with parchment paper.\nIn a medium bowl, whisk together the flour, salt, and baking soda. 3. In a large bowl, mash together the banana, peanut butter, applesauce, and vanilla with the back of a fork. Whisk in 1/3 cup water, scrape the sides, and mix well.\nAdd the flour mixture to the banana mixture and stir together until just combined. Stir in the oats and chocolate chips.\nUse a small ice cream scoop or spoon to drop ping pong ball–size dollops of cookie dough onto the prepared baking sheets. They don’t spread much, so they only need 1/2 inch of space between the cookies. Bake for 10 minutes, or until lightly browned on the bottom. Let them cool on the baking sheet for 10 minutes before devouring. You can freeze baked cookies in a gallon-size freezer bag for up to 3 months.",
            "Image": "//20fix.com/xfood/img/vegan-egg-free-chocolate-chip-peanut-butter-and-banana-cookies.jpg"
        }
    ],
    "t": 266,
    "p": {
        "limitstart": 0,
        "limit": 25,
        "total": 266,
        "pagesStart": 1,
        "pagesStop": 10,
        "pagesCurrent": 1,
        "pagesTotal": 11
    }
}